[{"picture_filename":"5e54da309d796_Khaled.png","firstname":"Khaled","lastname":"Aboulazm","title":"Dr.","description":"Dr. Khaled Aboulazm is current a professor and Chairman of Orthodontic Department at the University of Pharos Faculty of Dentistry, Alexandria, Egypt. \r\nHe is part of the founders of this Department. He maintains a private practice as the 2nd generation orthodontist after his father who was a pioneer orthodontic professor in the MENA region. \r\nDr. Khaled shifted to a Damon limited office by 2007 after believing in the system, in addition Dr Khaled was one of the founders members of  Damon KOL in MENA area."},{"picture_filename":"5da6e731594fa_Dr. Nasir Al Hamlan.JPG","firstname":"Nasir","lastname":"Al Hamlan","title":"Dr.","description":"Ÿ Fellow of International College of Dentists, Washington D.C., USA\r\nŸ Membership of the Royal College of Surgeons of Edinburgh in Orthodontics\r\nŸ Master of Science Degree in Orthodontics, King's College, University of London, UK\r\nŸ Master Degree of Public Health, Tulane University, School of Public Health &\r\nTropical Medicine, New Orleans, Louisiana State, USA\r\nŸ Certificate in Advanced Education in General Dentistry, Louisiana State University,\r\nSchool of Dentistry, New Orleans, Louisiana State, USA\r\nŸ Bachelor of Science in Dental Surgery, King Saud University, College of Dentistry,\r\nRiyadh, Saudi Arabia\r\nADMINISTRATION ACTIVITIES\r\nŸ Consultant and Head Division, Orthodontic Division, King AbdulAziz Dental Center,\r\nNational Guard Health Affairs, Ministry of National Guard, Riyadh, Saudi Arabia\r\nŸ Vice President, The Middle East Section of the International College of Dentists"},{"picture_filename":"58de5b7b212d6_06_ANDREA_ALBERTI-157x157.png","firstname":"Andrea","lastname":"ALBERTI","title":"Doctor","description":"Il dr. Alberti si laurea in odontoiatria e protesi dentaria presso l’Alma Mater Studiorum di Bologna nel 1999 con tesi in ortodonzia sociale svolta in Brasile.\r\n\r\nDal 2000 al 2001 ha frequentato il Gelb Center della TUFTS University di Boston in qualità di resident integrato con compiti clinici e di ricerca (uno dei più importanti centri al mondo dedicati esclusivamente alla diagnosi ed al trattamento dei disordini temporo-mandibolari). Di ritorno dall’esperienza americana inizia la libera professione instaurando numerosi rapporti di consulenza.\r\n\r\nNel 2003 apre il proprio studio dedicato esclusivamente all’ortodonzia.\r\n\r\nDal 2005 al 2008 ha collaborato con contratto libero professionale presso il reparto di Ortognatodonzia e Gnatologia del dipartimento di Odontostomatologia dell’Università di Bologna con compiti clinici e di integrazione all’insegnamento.\r\n\r\nDal 2010 è socio della World Federation of Orthodontist (WFO) e dell’Associazione Americana di Ortodonzia (AAO) e dal 2011 socio ordinario della SIDO (Società Italiana di Ortodonzia).\r\n\r\nNel 2011 ha conseguito la specializzazione in ortognatodonzia presso l’Università G. D´Annunzio di Chieti.\r\n\r\nDal 2013 è professore a contratto presso la Scuola di Specializzazione in Ortognatodonzia dell’Università G. D’Annunzio di Chieti.\r\n\r\nIl dr. Alberti è stato relatori a numerosi corsi e congressi in Italia e all’estero e nel 2013 ha fondato il forum di ortodonzia clinica www.lacompagniaortodontica.it."},{"picture_filename":"58e50a216cdf9_ALONSO.jpg","firstname":"Teresa","lastname":"ALONSO","title":"Doctor","description":"Physician specializing in Stomatology (Lisbon). Former assistant physician at St José Hospital, Lisbon. Master in Orthodontics (Porto School of Medicine). Post-Graduate in Orthodontics (Roth-William Center) Post-Graduate in Occlusodontics and Orofacial pain. Speaker (Barcelona University of Dental Medicine). Member of S.P.D.F., W.I.S.O., S.E.D.O. and A.E.S.O.R."},{"picture_filename":"5943acd83c6f0_Matias-Anghileri-155x155.png","firstname":"Matias","lastname":"Anghileri","title":"Doctor","description":"Odontólogo especialista en Ortodoncia y Ortopedia Funcional de los Maxilares. Miembro de la World Federation of Orthodontist y de la Asociación Iberoamericana de Ortodoncistas. Presidente de la AIOI (Academia Internacional de Odontología Integral) Bahía Blanca.\r\n\r\nDentro de sus actividades académicas se desempeña como Profesor invitado en la Carrera de Especialista de Ortodoncia de la Universidad Católica Argentina (SAO), Profesor invitado del Posgrado de Ortodoncia de la Facultad de Odontología de Córdoba. Exprofesor adjunto en la materia de Arco Recto en la Universidad de Morón.\r\n\r\nHa impartido cursos y conferencias en la Sociedad Argentina de Ortodoncia y en instituciones de toda Argentina, Autralia, Colombia, Bolivia, Perú, Ecuador y Uruguay.\r\nPrimer Conferencista Argentino en participar como ponente en el Forum de EE.UU."},{"picture_filename":"5d974ca01a87f_trombi  N ARNAUD-PELLET.jpg","firstname":"Noëlle","lastname":"ARNAUD- PELLET","title":"Mme","description":"Exercice libéral  à Marseille (depuis 1979)\r\n\r\nExercice hospitalier : Service Chirurgie Maxillo Faciale, Hôpital de la Conception, Marseille (depuis 1979)\r\n• Intervenante à la Faculté d’Odontologie de Marseille pour les DES1 et DES 2 : unité d'Orthodontie depuis Avril 2002.\r\n•Enseignante à l'école d'Orthophonie de la Faculté de Médecine de Marseille de 2008 à 2017.\r\n• Intervention dans le DU d'Occlusodontie depuis 2007.\r\n•Intervenante au Collège d'ostéopathie de Provence de 2005 à 2015.\r\n•Présidente de l'association \"Langue Fonctions Equilibres\" pour la formation pluridisciplinaire de professionnels de santé s'intéressant aux dysfonctions oro faciales \r\n• Responsable de l’enseignement du module « orthophonie et orthodontie chez l’adulte » au sein de l’Académie d'orthodontie Aix en Provence depuis 2015."},{"picture_filename":"582445b541556_Assor.jpg","firstname":"Jacques-Yves","lastname":"ASSOR","title":"Doctor","description":"Titulaire du certificat d’excellence en orthodontie\r\n(Board Français).\r\nDiplôme de Chirurgie dentaire de l’Université Paris 7.\r\nTitulaire du C.E.C.S.M.O. de l’Université Paris 7.\r\nAncien assistant à l’Université Paris 7.\r\nDiplôme Universitaire d’orthodontie linguale de\r\nl’Université Paris 5. Membre titulaire de la\r\nS.F.O.D.F. et de l’E.S.L.O.\r\nPraticien Damon depuis 2005. Consultant\r\ncertifié Damon pour la France."},{"picture_filename":"57f2923b88966_Speaker-2016-Badawi.jpg","firstname":"Hisham","lastname":"BADAWI","title":"Doctor","description":"•Member of many associations including the American Association of Orthodontists, the Canadian Association of Orthodontists, the Alberta Dental Association, the Royal College of Surgeons of Edinburgh and a Fellow of the Royal College of Dentists of Canada.\r\n•Published many articles in a variety of professional publications.\r\n•A pioneer in the field of 3-D orthodontic biomechanics research. Built the OSIM (orthodontic simulator) with a team at the University of Alberta.\r\n•Internationally recognized lecturer"},{"picture_filename":"584199e906de4_Speaker-2016-Bagden.jpg","firstname":"Alan","lastname":"BAGDEN","title":"Doctor","description":"•Diplomate of the American Board of Orthodontics, a Fellow in the American College of Dentists and Pierre Fauchard Honorary Dental Society.\r\n•Lectured at the European Orthodontic Society annual meeting, the Canadian Association of Orthodontists annual meeting and numerous Damon events, both domestically and internationally. Frequent lecturer at the University of Maryland orthodontic residency program, the Children’s National Medical Center orthodontic residency program in Washington, D.C., the AAO annual session and various other international events.\r\n•Published numerous articles in a variety of professional publications.\r\n•Co-authored the original \"Damon® Workbook\" with Dwight Damon in 2003 and has contributed book chapters in published textbooks concerning self-ligation."},{"picture_filename":"5a6f4122b4ba3_Nasib.jpg","firstname":"Nasib","lastname":"Balut","title":"Dr.","description":"Graduated from The Technological University of Mexico.\r\n Obtaining the best average of the 1979-1983 Generation,titled with Honorific Mention. Postgraduate of Orthodontics at Loyola University of Chicago.\r\n 1985-1987 Master’s Degree in oral Biology at loyola University of Chicago.\r\n 1985-1987 Certificate with Suitability by the Mexican Orthodontists Association, Orthodontists School, recognized by the General Direction of Dental Professions.\r\n Postgraduate Director of Orthodontics at The Technological University of Mexico.\r\n 1994-2000. President of the Mexican Orthodontic Council,\r\n 2006-2009. Member of the following Associations: Mexican Dental Association, Orthodontic Association of the D.F., Mexican Association of Orthodontics, Orthodontists School, American Association of Orthodontics, World Federation of Orthodontists.\r\n CUM LAUDE Award, November 9, 2003, in México City. He has taught more than 500 courses and conferences nationally and internationally."},{"picture_filename":"590308c3f0a2b_Dr_Bandeen-157x157.png","firstname":"Tim","lastname":"Bandeen","title":"Doctor","description":"Dr. Bandeen graduated with honors from the University of Michigan School of Dentistry where he was inducted into the Omicron Kappa Upsilon dental honors society. He received his MS and orthodontic specialty training from the University of Tennessee where his thesis was honored with the James Powell Research Award. Dr. Bandeen has served on the faculty of the orthodontics department at the University of Tennessee as a clinical instructor and as director of the graduate course in cephalometrics and radiology. He shares a private practice with his wife and dentist, Dr. Emily Bandeen, and lectures nationally on clinical efficiency and tracking practice metrics."},{"picture_filename":"58da6b9d24abc_Dr-Barron1.jpg","firstname":"Tom","lastname":"BARRON","title":"Doctor","description":"Dr. Barron has been treating\r\npatients exclusively with Low\r\nFriction\/Low Force PSL in his\r\nprivate practice for 14 years.\r\nHe is an original member of\r\nthe Damon Champion Group and Key Opinion\r\nLeader and member of the ORMCO Speakers\r\nBureau. He is co-author of the Damon PSL\r\nUniversity Teaching Modules and is a member\r\nof the Dean’s Faculty and part time Assistant\r\nClinical Professor in the Department of\r\nOrthodontics at the University of Maryland.\r\nHe has recently co-authored a paper titled:\r\nA Practical Treatment Objective: Alveolar\r\nBone Modeling with a Fixed Continuous-\r\nArch Appliance and is a regular presenter at\r\nORMCO’s annual International Forum."},{"picture_filename":"5c7545c2d874a_Dr_Andreas_Bartelt.jpg","firstname":"Andreas","lastname":"Bartelt","title":"Dr.","description":"–","link":"www.drbartelt.de"},{"picture_filename":"5ec3694fd9114_Dr. Osama Basri.jpg","firstname":"Osama","lastname":"Basri","title":"Dr.","description":"SPECIALTY AND BOARD CERTIFICATION:\r\n\r\nDiplomate, American Board of Orthodontics                                                                     2013\r\n\r\nFellow, Royal College of Dentists of Canada. (Orthodontics)                                           2012\r\nFRCD(C)\t\r\n\r\n\r\nEDUCATION AND TRAINING\r\n\r\n\r\n2013\tChildren’s Hospital of Pittsburgh of UPMC\t Fellow                Craniofacial \r\n\tPittsburgh, Pennsylvania.                                                              Orthodontics\t\r\n\r\n2010\tJacksonville University\t Resident\t Orthodontics\r\n\tJacksonville, Florida.\r\n\r\n2011\tJacksonville University   \t M.Ed. \t Master in Education             \r\n\tJacksonville, Florida.                                                                     And Leadership\t\r\n\r\n\r\n\r\n\r\nADMINISTRATIVE RESPOSIBILITIES AND COMITTEES \r\n\r\n\r\n10\/2019- present      Member, Board of Directors \r\n                                 Saudi Orthodontic Society, Riyadh SA\r\n\r\n1\/2016-present        Head - Craniofacial and Cleft lip and palate unit\r\n                               King Faisal Specialist Hospital & Research Center, Jeddah, SA\r\n\r\n5\/2016-12\/2018       Member- Medical Staff Credentials and Clinical \/ Professional Privileges Committee \r\n                               King Faisal Specialist Hospital & Research Center, Jeddah, SA           \r\n\r\n9\/2015-1\/2019       Member- Evidence Based Practice Committee (Clinical Pathways)  \r\n                                  King Faisal Specialist Hospital & Research Center, Jeddah, SA                     \r\n                     \r\n\r\n                                                 \r\n\r\n\r\n                                                                \r\n\r\n\r\n\r\n\r\n\r\n\r\nPUBLICATIONS \/ RESEARCH\r\n\r\n\r\n1.\tHelal N, Basri O, Losee JE, Ford M, Martin M.  Relationship of Velopharyngeal Insufficiency with Face Mask Therapy in Patients with Cleft Lip and Palate Cleft Palate Craniofac J 2019July. Epub 2019 July\r\n\r\n2.\tNM Helal, OA Basri, HA Baeshen . Significance of Cephalometric Radiograph in Orthodontic Treatment Plan Decision. The journal of contemporary dental practice,  July2019\r\n\r\n3.\tHelal N, Basri, O , Grady J .Parents’ Perceptions of Breathing Pattern Changes, Sleep Quality, and Fatigue in Children after Rapid Maxillary Expansion: A Survey and Case Series Study. The Open Dentistry Journal Feb2019\r\n\r\n4.\tNaran S, Camison L, Lam B, Basri O, Schuster L, Martin B, Losee JE. Dental sequelae of pediatric maxillofacial trauma. J Pediatr Dent 2017;5:50-3\r\n\r\n5.\tChen W, Santos G, Job J, Basri O, Losee JE, Branstetter B, Schuster L. Mixed Dentition Cleft\/craniofacial Patients: Incidental Head And Neck Findings On Cone Beam CT. \r\n\r\n6.\tShakir S, Basri O, Cray JJ, Naran S, Smith DM, MacIsaac ZM, Weinberg SM, Mooney MP, Losee JE, Cooper GM. Biopatterned Recombinant Human Bone Morphogenetic Protein 2 Does Not Induce Pansynostosis or Growth Restriction in the Immature Craniofacial Skeleton. \r\n\r\n7.\tNaran S, Kirschner R, Schuster L, Basri O, Ford M, Goldstein J, Grunwaldt LJ, Mooney MP, Losee JE. The Controversial Simonart’s Band: Effect on Cleft Classification, Implications for Billing and Reimbursement, and Recommendations for Standardized Nomenclature.. Cleft Palate Craniofac J 2016 Sep 12. Epub 2016 Sep 12.\r\n\r\n8.\tBasri O, Sheridan J, Vig P, Araujo C.  The Perceived Value of Required Research in North American Orthodontic Postdoctoral Training. 2012 (Part of the research requirements during orthodontic residency).\r\n\r\n9.\tBasri OA, Shahin SY, Hilal NM, Hassan AH. Orthodontic Treatment Needs in the Western Region of Saudi Arabia. Saudi Dental Journal 2008; 20 (SI) Abstr.P06.\r\n\r\n\r\n10.\tBasri OA, Hilal NM, Hassan AH Combined Surgical-Orthodontic Treatment for Class III Malocclusion: A Case Report. Saudi Dental Journal 2008;20(SI) Abstr.P05\r\n\r\n\r\n\r\nBOOK CHAPTERS:\r\n\r\n\r\n1.\tBasri, O.A., Schuster, L.A. \"Presurgical Infant Orthopedics and NAM\" Chapter 27 in J.E. Losee and R. E. Kirschner (Eds.) Family Companion to Comprehensive Cleft Care. St. Louis, MS: Quality Medical Publishing, Inc.\r\n\r\n\r\n\r\n\r\n\r\nJOURNALS:\r\n\r\n1.\tReviewer at The British Journal of Oral & Maxillofacial Surgery , Jan-2019 \r\n2.\tReviewer at Journal of King Abdulaziz University - Medical Sciences, March 2019\r\n\r\n\r\n\r\nPROFESSIONAL AND SCIENTIFIC SOCIETIES:\r\n\r\nAmerican Dental Association \t2010-present\r\nAmerican Association of Orthodontists\t2010-present\r\nRoyal Collage of Dentists of Canada\t2013-present\r\nAmerican Cleft Palate-Craniofacial Association\t2013-present\r\nCollage of Diplomates American Board of Orthodontics                                                2013-present\r\nSaudi Dental Society- EC Board (Western Region)                                                        2016-present\r\n Saudi Orthodontic Society- Board of Directors Member                                                2007-present"},{"picture_filename":"57ee6360ed147_Dr Baumann.jpg","firstname":"Dieter","lastname":"BAUMANN","title":"Doctor","description":"Dieter Baumann wurde 1952 in der Barockstadt Ludwigsburg bei Stuttgart geboren.\r\n1969 – 1972 Ausbildung als Werbefotograf\r\nseit 1972 Tätig als Sportbildjournalist\r\n1982 Übernahme der Agentur „Pressefoto Baumann“ Spezialisierung auf\r\nSportfotografie, Arbeit für Zeitung und Verlage. Zwischen 1972 und 1992\r\nfotografierte er mehrere Olympische Spiele, Fußballweltmeisterschaften,\r\nTour de France, usw.\r\n1992 Erstmals Kontakt mit der digitalen Fotografie bei der Olympiade in Barcelona\r\n1993 Gründung der Firma digital-photo-systeme. Zunächst nur Vertrieb\r\nhochwertiger Digital-Kameras, Zubehör und Bildarchivierungssysteme,\r\ndann auch Workflow-Management für Tageszeitungen.\r\nseit 1997 Seminare zum Thema digitale Dentalfotografie, Bildbearbeitung,\r\nArchivierung und Imaging. Referent bei verschiedenen Curricula und\r\nMasterstudiengängen."},{"picture_filename":"5e54deecb1114_Dr. Faraj.png","firstname":"Faraj","lastname":"Behbehani","title":"Dr.","description":"Assistant Professor and consultant in orthodontics\r\nDr Behbehani has been practicing orthodontics since year 2000 with special emphasis on passive \r\nself-ligation technique and invisible aligners. He lectured in several occasions in local meetings in Kuwait, Saudi Arabia, and United Arab Emirates. His main focus is how to maximize the benefits to the orthodontic practice and patients utilizing the best and most advanced features of the Damon System.\r\nQualification:\r\nDiplomate, American Board of Orthodontics, USA \/ 2006.\r\nMembership-Orthodontics from the Royal college of Surgeons, UK \/ 2005.\r\nCertificate & Master in Orthodontics – University of Kentucky, USA \/ 2000.\r\nDoctorate of Dental Surgery – University of Missouri, USA \/ 1996\r\nWorking experience in Kuwait:\r\nConsultant in orthodontics:  - Private Practice 2003 –current\r\n                                                    -Ministry of health 2000-2003\r\n                                                    -Kuwait Univ \/ Faculty of Dentistry 2003 – 2013\r\n                                                    -Key opinion leader for Damon system\r\n  \r\n\r\nResearch Experience:\r\nPublished scientific articles                            13\r\nSupervision of student research project       4\r\nAbstracts and professional presentations     27\r\nReviewer of scientific Journals                          5"},{"picture_filename":"5b3b4579db697_zakaria-bentahar.jpg","firstname":"Zakaria","lastname":"BENTAHAR","title":"Doctor","description":"Etudes de Médecine Dentaire 1989 - 1994 \r\nFaculté de Médecine Dentaire de Casablanca - Maroc \r\n-\tInterne du CHU Ibn Rochd de Casablanca 1994 - 1996 \r\n-\tCES de Biomatériaux - Université Denis DIDEROT - 1996 - France \r\n-\tCES d’ODF - Université Denis DIDEROT - 1997 - France \r\n-\tDEA - 1999 - 2001 - Faculté de Médecine de Casablanca \r\n-\tDiplôme National de Spécialité Odontologique 1996 - 2000\r\nFaculté de Médecine Dentaire de Casablanca - Maroc \r\n-\tCycle Supérieur de Gestion 2001 - 2003 - ISCAE - Casablanca - Maroc \r\n-\tDU d’Orthodontie Linguale - Université Paris Descartes - 2003 - 2005 - Paris - France \r\n-\tThèse d’Université - Faculté des Sciences de Casablanca - 2010 - Maroc \r\n-\tDU de Pédagogie des sciences de la santé - Faculté de Médecine Dentaire de Casablanca - 2014\r\n-\tDU de Communication Médicale - ISPED - Bordeaux - 2013 - France \r\n-\tEnseignant depuis 2000 - Université Hassan II - Casablanca - Maroc \r\n-\tProfesseur depuis 2010 - Université Hassan II - Casablanca - Maroc"},{"picture_filename":"5d61987554d7e_Dr_Klaus_Juergen_Berndsen.jpg","firstname":"Klaus-Jürgen","lastname":"Berndsen","title":"Dr.","description":"– Wissenschaftlicher Direktor am ISST-Unna – Internationales Zentrum für Rehabilitation\r\n– Langjähriger Lehrbeauftragter an der Universität Dortmund, Fachbereich Rehabilitation und der Universität Frankfurt, Fachbereich KFO\r\n– Inhaber div. medizintechnischer Patente\r\n– Autor von Büchern, Fachbuchbeiträgen und Fachartikeln\r\n– Internationale Referententätigkeit"},{"picture_filename":"5d6198dfb6097_Dr_Michael_Berthold.jpg","firstname":"Michael","lastname":"Berthold","title":"Dr.","description":"Dr. Berthold verfügt über eine langjährige internationale Erfahrung im chirurgischen Bereich. Er ist Fachzahnarzt für Oralchirurgie und M. Sc. Implantology & dental surgery, war Oberarzt der renommierten Privat-Zahnklinik Schloss Schellenstein und Leiter der implantologischen Abteilungen mehrerer Praxen in London. Neben der praktizierenden Tätigkeit ist Dr. Berthold als wissenschaftlicher Mitarbeiter an der LMU München in Forschungsprojekte für innovative Therapiekonzepte eingebunden."},{"picture_filename":"590874c6379fa_bicknell.png","firstname":"Michael","lastname":"Bicknell","title":"Doctor","description":"A diplomate of the American Board of Orthodontics, Dr. Bicknell earned his DDS and completed a residency in orthodontics from the University of Illinois at Chicago where he also received a MS in oral biology. Now in private practice, he is a former clinical instructor at the university and continues his involvement there by lecturing to dental students and orthodontic residents throughout the year. He is active in his local community where he supports many organizations."},{"picture_filename":"59086ecaab37b_birnie2.jpg","firstname":"David","lastname":"BIRNIE","title":"Doctor","description":"David Birnie graduated from Edinburgh Dental School in 1970 and spent three years as a lecturer in periodontology before starting his orthodontic training in 1975. Later that year he was appointed registrar in orthodontics at Kingston Hospital, Surrey and at the Royal Dental Hospital, London. In 1977, he moved to the Eastman Dental Hospital as a senior registrar in orthodontics. Since 1982, he has been a consultant orthodontist at Queen Alexandra Hospital, Portsmouth, is a visiting consultant and senior clinical lecturer in orthodontics at the University of Bristol Dental School and is in private orthodontic practice.\r\n\r\nClinical interests include:\r\n\r\n-clinical applications of computers and health informatics \r\n -pre-adjusted edgewise appliances \r\n -self-ligating brackets \r\n -clinical application of biomaterials research \r\n -the non-surgical management of severe malocclusion \r\n -orthognathic surgery \r\n\r\nDavid has lectured extensively throughout the United Kingdom including invited presentations at the British Orthodontic Conference, the Consultant Orthodontists Group Symposium, the British Dental Association's Annual and Scientific Meeting in addition to presenting lectures and papers in Cyprus, China, Belgium, France, Hong Kong, the Republic of Ireland, South Africa and in the USA. Since 2004, David has given courses on passive self-ligation, and fully customised orthodontic appliances, in Australia (Brisbane and Perth), Croatia, Denmark, Malaysia, the Netherlands, New Zealand, Poland, Saudi Arabia, Singapore, Spain, Sweden, Thailand, the United Arab Emirates and the United Kingdom.  David has also given workshops at the International Damon Symposia held in Monaco (2005, 2006), Barcelona (2007), Rome (2008) and London (2009, 2010). In 2011, he will speak at the 10th Annual Damon Forum in Orlando, Florida. \r\n\r\nWith Nigel Harradine, David has co-presented Excellence in Orthodontics in the United Kingdom since the first course in 1987 in York and at Excellence in Orthodontics overseas courses in Australia, Germany, Italy, Malaysia, Norway, Republic of Ireland, Switzerland and The Netherlands."},{"picture_filename":"59086e579c393_birnie2.jpg","firstname":"David","lastname":"BIRNIE","title":"Doctor","description":"Graduated from Edinburgh Dental School in 1970 and spent three years as a lecturer in periodontology before starting his orthodontic training in 1975. Later that year he was appointed registrar in orthodontics at Kingston Hospital, Surrey and at the Royal Dental Hospital, London. In 1977, he moved to the Eastman Dental Hospital as a senior registrar in orthodontics. Since 1982, he has been a consultant orthodontist at Queen Alexandra Hospital, Portsmouth, is a visiting consultant and senior clinical lecturer in orthodontics at the University of Bristol Dental School and is in private orthodontic practice.\r\nDavid has lectured extensively throughout the United Kingdom including invited presentations at the British Orthodontic Conference, the Consultant Orthodontists Group Symposium, the British Dental Association's Annual and Scientific Meeting in addition to presenting lectures and papers in Cyprus, China, Belgium, France, Hong Kong, the Republic of Ireland, South Africa and in the USA. Since 2004, David has given courses on passive self-ligation, and fully customized orthodontic appliances all over the World.\r\nDavid is on the Council of the Faculty of Dental Surgery and is Chair of the Faculty of Health Informatics at the Royal College of Surgeons of Edinburgh where he is also a member of the Specialist Advisory Board in Orthodontics, Dental Examinations Committee and was an ex officio member of College Council. David passed the Diploma in Medical Informatics of the Royal College of Surgeons of Edinburgh in 2001, a part-time two year course on health informatics delivered over the internet. David represented the College on General Dental Council from 1998-2003 during which time he was a member of the Central Examining Board for Dental Hygienists, the Dental Auxiliaries Committee, the Health Committee, the Professional Conduct Committee, the PCD Curricula Overview Group, the Orthodontic Therapists Curriculum Working Group, the Registration Subcommittee of the Education Committee and the Registration Review Group. David is a past chairman of the Specialist Advisory Committee in Orthodontics and Paediatric Dentistry. At Queen Alexandra Hospital, David was Clinical Director for Surgery, Trauma and Oncology from 1994 to 1999 and is currently Associate Medical Director for Queen Alexandra Hospital's."},{"picture_filename":"5c745966c594a_Dr_Stefan_Blasius.jpg","firstname":"Stefan","lastname":"Blasius","title":"Dr.","description":"–","link":"www.drblasius.de"},{"picture_filename":"57f2928502c75_Speaker-2016-Bogdan.jpg","firstname":"Frank","lastname":"BOGDAN","title":"Doctor","description":"Dr. Frank Bogdan graduated from Mt. St. Mary’s College in 1970 where he received a B.S.\r\ndegree in Biology. He pursued his dental education at the University of Medicine and\r\nDentistry of New Jersey, receiving his DMD in 1973 and certificate in orthodontics in 1976.\r\nDuring his last year of specialty training, he served as a teaching associate, giving lectures\r\nin orthodontics to undergraduate dental students. Currently he is president of the UMDNJ\r\nOrthodontic Alumni Society, a post at which he has been serving since 1997. Dr. Bogdan\r\nhas guest lectured at the University since 2001 and joined the part-time faculty in 2003. He\r\nhas maintained an active specialty practice in Bayonne, New Jersey since 1976.\r\nOrthodontics and teaching have always been his passion. He has lectured for orthodontic\r\nsocieties, study groups, and universities in the United States, Mexico, and Europe. The\r\none- and two-day presentations on the Damon System and advancements in jaw\r\northopedics have been well received. In addition, he heads up the regional Damon study\r\ngroup of orthodontists utilizing this state-of-the-art treatment system."},{"picture_filename":"6034f841e96cc_Capture d’écran 2020-12-18 à 11.06.02.JPG","firstname":"Nicolas","lastname":"BOISSI","title":"Docteur","description":"Diplôme de Dr en Chirurgie Dentaire à l'université d'odontologie de Marseille 2006\r\nCECSMO à l’université d’odontologie de Marseille 2006-2010\r\nDiplômé en ODF à l’université de Marseille en 2010\r\nAssistant à l’hôpital de Marseille entre 2013 et 2015\r\nPratique l’orthodontie exclusive depuis 2006\r\nPratique libérale à la Ciotat\r\nCréation de l’association « Ortho du Sud » en 2013 (conférences sur les traitements chirurgicaux)\r\nMembre du comité d’organisation de la SFODF de Marseille en 2016\r\nSecrétaire de la SBR du Sud-Ouest en depuis 2017\r\nSpeaker Sirona 2016-2018\r\nMembre et Speaker Ortho-Up depuis 2018\r\nCréateur du Master IDO, avec le Docteur Serge Dahan en 2018\r\nSpeaker Ortho Plus depuis 2019\r\nSpeaker Itero 2020\r\nSpeaker Dental Monitoring 2020"},{"picture_filename":"596b11aec7864_DSC_9623 copy - Dr. Bader Borgan.jpg","firstname":"Bader","lastname":"Borgan","title":"Dr.","description":"Dr. Borgan received his dental degree from the\r\nUniversity of Jordan which was shortly followed by a\r\nMasters of Orthodontics from Egypt and a\r\nfellowship from the Royal College of Surgeons in\r\nEdinburgh, UK Dr. Borgan is a key opinion leader in\r\nthe region of EMEA (Europe, Middle East & Africa)\r\nfor ORMCO (Inventors of Damon & Insignia).\r\nDr. Borgan carries various workshops and lectures in\r\nthe Middle East and Worldwide in the field of\r\nself-ligation and digital orthodontics. He loves to\r\nshare his passion towards creating beautiful smiles\r\nand faces. Dr.Borgan believes that using the most\r\nadvanced technologies in diagnosis and treatment\r\ncan produce beautiful smiles without removing\r\nteeth or major surgeries."},{"picture_filename":"5903007580b5a_BOUSERHAL2.jpg","firstname":"Joseph","lastname":"BOUSERHAL","title":"Doctor","description":"Prof. Dr. Bouserhal is Earned a Doctor in Dental\r\nSurgery Degree from Saint-Joseph University, a\r\nMaster Degree in Orthodontics from the University\r\nof Louvain, a PhD from the University of Liège, a\r\nContinuing Education Diploma in Orthodontics from the University of\r\nSouthern-California, a Diploma of Specialist in Lingual Orthodontics from\r\nthe University of Paris VII, a Diploma in 3D Imaging and a Diploma in\r\nDental Clinical Research from the University of Toulouse. Professor in the\r\nDepartment of Orthodontics at Saint-Joseph University, Visiting Professor\r\nat Beirut Arab University and Adjunct Clinical Professor at Boston University.\r\nMember of the Executive Committee of the World Federation of\r\nOrthodontists, the Angle Society of Orthodontists, East Component and the\r\nTweed Foundation for orthodontic Research and Education.."},{"picture_filename":"5908741c97537_bovenizer.jpg","firstname":"Todd","lastname":"Bovenizer","title":"Doctor","description":"A recertified diplomate of the American Board of Orthodontics, Dr. Bovenizer earned his DDS and certificate in orthodontics from West Virginia University School of Dentistry. In private practice, he is past president of the North Carolina Association of Orthodontists and the Summit 360 Study Club. He has lectured nationally on the Damon System, is a Damon Mentor, has been published in the JCO and other orthodontic journals. Dr. Bo’s office is a popular site for professionals in the field to study the Damon system and his dynamic culture."},{"picture_filename":"5a339be142498_Dra.-Chiara-Buraglio-157x157.png","firstname":"Chiara","lastname":"BURAGLIO","title":"Dott.ssa","description":"Laureata in Odontoiatria e Protesi Dentaria presso l’Università degli Studi di Milano nel 1987, libero professionista presso il reparto di Ortodonzia dell’ Istituto Stomatologico Italiano di Milano dal 1998, Italian Board of Orthodontics nel 2001, Socio Fondatore SIDOP, Specialista in Ortognatodonzia nel 2006, Tesoriere SIDO 2012 -2013 , Master in Tecnica Ortodontica Damon nel 2009,  Coach e Master di Programmazione Neuro Linguistica nel 2012, relatrice a congressi, autrice di pubblicazioni."},{"picture_filename":"58d9258008821_burns.png","firstname":"Mary","lastname":"BURNS","title":"Doctor","description":"Dr. Burns earned her degree in Dental Medicine with honors from the University of Pittsburgh and her Certificate in Orthodontics and Masters of Education and Science from the Ohio State University. She received her certificate from the Roth Institute of TMJ centered orthodontic treatment and serves on the faculty of the OBI Foundation for Bioesthetic Dentistry. In orthodontic practice for over 27 years, Dr. Burns lectures internationally on the topics of Biologic Orthodontics and the role of the orthodontist in the treatment of patients with sleep disordered breathing. She also serves as a research mentor for orthodontic residents at West Virginia University, the University of Nebraska at Lincoln and the University of Pennsylvania."},{"picture_filename":"57bb13e33f456_timthumb.php.jpeg","firstname":"Christelle","lastname":"CAUCHOIS","title":"Coach","description":"Coach diplômée de l’Université Paris VIII, elle a créé ProjetSens afin d’apporter\r\ndes solutions adaptées et locales aux attentes des professionnels.\r\nSes fonctions de responsable ressources humaines et de consultante dans un\r\ncabinet de chasseur de tête spécialisé dans le secteur de la santé, l’ont amenée\r\nà accompagner de nombreux dirigeants, cadres et équipes dans leur réussite.\r\nSa démarche est résolument tournée vers le développement du potentiel."},{"picture_filename":"57e63a28214e7_chris-chang.jpg","firstname":"Chris","lastname":"CHANG","title":"Doctor","description":"Dr. Chris Chang received his PhD in bone physiology and Certificate in Orthodontics from Indiana University in 1996 and is a Diplomate of American Board of Orthodontics(ABO). He is the author of iAOI workbook, ABO Case Reports, Orthodontics, Jobsology and publisher of International Journal of Orthodontics and Implantology(iJOI). Dr. Chang frequently lectures worldwide on a wide range of topics, including impaction treatment, OrthoBoneScrews, implant-orthodontic combined treatment and Jobs’ effective presentations. As a private instructor since 2006, he has taught over 2,000 doctors from more than 21 countries. In addition to teaching and publishing, he also founded Newton’s A, Inc. and Beethoven Orthodontic and Implant Group, based in Hsinchu, Taiwan. His passion in digital learning has led him to produce a complete series of video courses on orthodontics and implantology and an App, Beethoven Dental Encyclopedia. He has been actively involved in the design of orthodontic bone screws and application on impaction treatment. His latest focus is implant and orthodontic combined treatment."},{"picture_filename":"59010a136c26e_Mr_Chase_Landy-LowRes_1x1.3LR.png","firstname":"Landy","lastname":"Chase","title":"Mr.","description":"Landy Chase is a top US-ranked consultant and award-winning author who works exclusively with orthodontists to increase case starts. In the last 36 months alone, he has worked with 100+ orthodontic practices to improve case acceptance. A featured speaker for the AAO, the Schulman Study Group and Dr. Terry Sellke's Bottomline training program, he has written four best-selling books for the profession, including Yes to Treatment and No to Lost Cases with sales of over 5,000 copies. Prior to specializing in orthodontics, Mr. Landy served clients in over 60 industries in countries around the world with 2,000+ client engagements and books on selling to his credit that have earned top business awards."},{"picture_filename":"584e66874fcd9_francois-chevalier.jpg","firstname":"François","lastname":"CHEVALIER","title":"Doctor","description":"Docteur en chirurgie dentaire, spécialiste qualifié en orthopédie dento-faciale Diplômé de la Faculté de Paris. Thèse de docteur en chirurgie dentaire Paris 5 en1984 CECSMO de Nantes 1991 Le Docteur Chevalier pratique le système DAMON depuis 2004 Intervenant Study Group DAMON depuis 2011"},{"picture_filename":"5a665bf98ab11_Dr_Coreil_Mark.jpg","firstname":"Mark","lastname":"Coreil","title":"Dr.","description":"Dr. Coreil is a board certified orthodontist who has worked with children with craniofacial problems for nearly 30 years. In private practice, he is also associate professor of clinical orthodontics at Louisiana State University School of Dentistry and is actively involved as an orthodontist on the Children's Hospital Cleft and Craniofacial Team. He received his DDS and his orthodontic specialty training from Louisiana State University School of Dentistry. He completed the Roth\/Williams Advanced Clinical Programs and lectures nationally and internationally on clinical and practice management issues related to orthodontics."},{"picture_filename":"58eccab47999f_Dr_richard_cure-157x157.png","firstname":"Richard","lastname":"CURE","title":"Doctor","description":"Dr Richard Cure, specialist in Orthodontics Honorary Associate Clinical Professor, Course and Clinical Director of Orthodontics, The University of Warwick. Fellow of the Higher Education Academy. Richard is the founder of LSO and he leads the team at this multi-surgery Orthodontic Practice in Leamington Spa. During more than 25 years in Orthodontics, Richard has gained vast experience in all modes of treatment and different appliance systems including over 5000 cases with the Damon System. His expertise has led to lecturing, examining and research appointments in the UK and abroad, including North America, Scandinavia, the Middle East and Far East and he has published papers in many scientific journals."},{"picture_filename":"57badc650421c_serge-dahan.jpg","firstname":"Serge","lastname":"DAHAN","title":"Doctor","description":"Chirurgien-dentiste spécialiste qualifié\r\nen orthopédie dento-faciale\r\nExercice privé spécialisé en ODF depuis 2007\r\nAncien interne des hôpitaux de Marseille\r\nAncien assistant hospitalo-universitaire\r\n(Hôpital de la Timone \/ Université d’Aix-Marseille)\r\nAttaché de consultation à l’hôpital de la Timone\r\n(Marseille)\r\nDiplôme Universitaire d’Odontologie Légale\r\nDiplôme Universitaire d’Evaluation du Dommage\r\nCorporel appliqué à l’Odontologie\r\nMaster 2 d’Anthropologie Biologique\r\nMaitrise de Sciences Biologiques et Médicales\r\nAuteur de nombreuses conférences et articles\r\nnationaux ou internationaux\r\n\r\n- Ancien interne des hôpitaux de Marseille\r\n\r\n- Ancien assistant hospitalo-universitaire (Hôpital de la Timone \/ Université Aix-Marseille)\r\n\r\n- Attaché de consultation à l’hôpital de la Timone (Marseille)\r\n\r\n- Diplôme Universitaire d’Odontologie Légale\r\n\r\n- Diplôme Universitaire d’Évaluation du Dommage Corporel appliqué à l’Odontologie\r\n\r\n- Master 2 d’Anthropologie Biologique\r\n\r\n- Maitrise de Sciences Biologiques et Médicales\r\n\r\n- Auteur de nombreuses conférences et articles nationaux ou internationaux"},{"picture_filename":"5a12e9c61cb19_Damiola.jpg","firstname":"Davide","lastname":"DAMIOLA","title":"Dottor","description":"Laureato in Odontoiatria e Protesi Dentaria (Università di Pavia).\r\nDal 2006 Collaboratore dell’ospedale S. Raffaele (Direttore Prof. E. Gherlone).\r\n2007 Corso teorico pratico di odontoiatria conservativa (Dott. Marco Veneziani).\r\n2008 Corso Di Perfezionamento in Ortodonzia (Università di Milano, Prof. Giampietro Farronato).\r\n2009 Consulente del servizio di ortodonzia Ospedale San Raffaele (Direttore Prof. E. F. Gherlone).\r\n2009 Master Damon System (Dott. Rafael Garcia Espejo e Dott. Ramon Perera Grau).\r\n2010 Corso annuale teorico pratico di protesi fissa (Dott. Domenico Massironi).\r\n2011 Certificazione Invisalign.\r\n2012 Relatore congresso Straight Wire e Self Ligating (con il Dott. Ennio Storti): evidenze scientifiche e innovazioni tecnologiche (Università degli studi di Milano, Scuola di Specializzazione in Ortognatodonzia). Titolo della Relazione: Dimensione Verticale nelle 2° Classi.\r\n2012 Corso ‘La rieducazione funzionale ortodontica nel bambino’ (Dott. Daniel Rollet).\r\nDal 2013 Relatore (con il Dott. Giuseppe Sabatini) del Cors : Realtà Clinica nei Sistemi Self – Ligating in Ortodonzia (23,4 crediti ECM).\r\n2014 Master Annuale in Parodontologia (Dr. Carlo Ghezzi – Dott.ssa Silvia Masiero).\r\n2014 Relatore al 1° Congresso Damon Italia (con il Dott. Giuseppe Sabatini). Titolo della relazione: D-Gainer e altre applicazioni per il recupero di spazio."},{"picture_filename":"57f2931ee1f76_Speaker-2016-Damon.jpg","firstname":"Dwight","lastname":"DAMON","title":"Doctor","description":"Dr. Dwight Damon is an industry-leading orthodontist widely known for his development of the Damon System. Dr. Damon is a pioneer in the field, lecturing worldwide to both doctors and staff on the most advanced orthodontic treatment philosophies. Holding a practice for more than 40 years, Dr. Damon has written several professional articles and his work has been featured in leading trade journals, including the Journal of Clinical Orthodontics and the American Journal of Orthodontics and Dentofacial Orthopedics. He is a member of leading industry associations, including: the American Association of Orthodontics, the Pacific Coast Society of Orthodontists, the American Dental Association and the Washington State Dental Association."},{"picture_filename":"57d3dedb502c0_francois-darque.jpg","firstname":"François","lastname":"DARQUE","title":"Doctor","description":"Spécialiste en Orthodontie C.E.C.S.M.O\r\nMaître de conférences Université Bordeaux II\r\nPraticien hospitalier\r\nDiplôme universitaire d’Orthodontie Linguale Paris V\r\nPratique libérale à Bordeaux"},{"picture_filename":"57ee94840ebed_Dr_Bill_2.jpg","firstname":"Bill","lastname":"DISCHINGER","title":"Doctor","description":"Dr. Bill Dischinger received his dental degree from Oregon Health & Science University School of Dentistry in 1997 and his certificate in orthodontics at Tufts University in Boston in 1999. His B.S. degree is from Oregon State University. In private practice with his father, Dr. Terry Dischinger, Bill has taught at their in-office comprehensive courses and used the Damon System for over 12 years. He is one of 12 certified Damon instructors who have taught and lectured extensively on passive self-ligation with the Damon System. He has also lectured nationally and internationally on a variety of subjects, including functional jaw orthopedics, indirect bonding, and practice management from a team approach. Dr. Dischinger has written articles published in Orthodontic Products, Orthotown and Ormco’s  Clinical Impressions and is actively involved in national study clubs that address the latest treatment techniques. He is a member of the American Association of Orthodontists, Pacific Coast Society of Orthodontists, the American Dental association and orthodontic professional associations that enable him to actively participate in continual education and remain current on advances in orthodontic treatment."},{"picture_filename":"5c80cc69d64bc_patrycja-157x157.png","firstname":"Patrycja","lastname":"Downarowicz","title":"Dr.","description":"Dr n. med. Patrycja Downarowicz - specjalista ortodonta\r\nUkończyła Uniwersytet Medyczny we Wrocławiu na Wydziale Lekarsko-Stomatologicznym. Obecnie jest adiunktem w Zakładzie Wad Rozwojowych Twarzy Katedry Ortopedii Szczękowej i Ortodoncji Uniwersytetu Medycznego we Wrocławiu. Przez wiele lat, jako specjalista ortodoncji, konsultowała w Klinice Chirurgii Szczękowo-Twarzowej UMED we Wrocławiu, w zespole zajmującym się leczeniem wad ortognatycznych pod kierownictwem dr n. med. Wojciecha Pawlaka. Prowadzi specjalistyczną praktykę ortodontyczną „OrthoLine”. \r\nUkończyła wiele krajowych i międzynarodowych szkoleń, tj.: Masterclass in Orthognathic Surgery w Londynie, kurs eksperta w ortodoncji przedchirurgicznej i chirurgii ortognatycznej na Międzynarodowym Uniwersytecie Katalońskim w Barcelonie. \r\nJest autorką licznych publikacji i wystąpień na konferencjach krajowych. Uczestniczka staży szkoleniowych (USA, Niemcy). \r\nJest członkiem Polskiego Towarzystwa Ortodontycznego i Europejskiego Towarzystwa Ortodontycznego."},{"picture_filename":"5c74619f29932_Dr_Ralf_Dux.jpg","firstname":"Ralf","lastname":"Dux","title":"Dr.","description":"–","link":"www.drdux.de"},{"picture_filename":"5faab506f2797_6ac9589f-27c0-475a-bdce-2edf43d5410d.jpeg","firstname":"André","lastname":"El Zoghbi","title":"Docteur","description":"Diplôme de Chirurgien-Dentiste de l’Université Libanaise - Beyrouth - en 1999\r\nMSc en Orthodontie \/ CECSMO – Paris 7 Garancière en 2005\r\nMRes Biomatériaux  - Mention Matériaux - ENSCP\/INSERM en 2007\r\nAssistant Associé en Orthodontie - Paris 7 Garancière, Chargé des cours et TP service ODF – de 2009 à 2012\r\nPraticien Attaché en Orthodontie, Hôtel Dieu de Paris et Pitié Salpetrière – de 2009 à 2012\r\nAuteur d’articles dans Orthodontie Française en 2013\r\nPratique libérale à Choisy le Roi (France)\r\nOrthodontie exclusive depuis 2010","link":"https:\/\/dr-elzoghbi-andre.chirurgiens-dentistes.fr\/"},{"picture_filename":"57d3de9c1e30f_skander-ellouze.jpg","firstname":"Skander","lastname":"ELLOUZE","title":"Doctor","description":"Docteur en Médecine dentaire en1981(Monastir en Tunisie).\r\nSpécialiste en Orthodontie C.E.C.S.M.O ( Bordeaux en 1986).\r\nDiplôme universitaire d’Orthodontie Linguale Paris V.\r\nConférencier international sur les thèmes suivants :\r\nSystèmes Auto-ligaturants Passifs,\r\nOrthodontie Linguale, Ancrage squelettique.\r\nAuteur de nombreux articles et études cliniques.\r\nAttaché d’enseignement au service d’Orthodontie\r\nde la Faculté de Bordeaux.\r\nMembre actif de l’ESLO, du GREAT, et du CEO.\r\nProfession libérale à Tunis depuis 1990."},{"picture_filename":"59db97f6250af_Photo Eljalran1.jpg","firstname":"Patrick","lastname":"ENJALRAN","title":"Docteur","description":"Diplomé de la faculté de chirurgie dentaire de Toulouse en 1978.\r\nLauréat de l'université Paul Sabatier ( Toulouse ).\r\nPratiquant l'orthodontie exclusive depuis 1979. ( Depuis 1982 à Albi ).\r\nSpécialiste qualifié en orthopédie- dento- faciale depuis 1984.\r\nPrincipales formations en orthodontie :\r\n- Formation à l'edgewise par le Dr Harry Dougherty , U.S.C. (cycle sur 3 ans 1980-1981-1982 , plus de 40 jours de formation ).\r\n- Formation à la Tweed foundation , Tucson Arizona .\r\n- Master Damon à Madrid ( cursus Espagnol ) 2008-2009 , Dr. Rafael Garcia Espejo - Dr. Ramon Perera Grau .\r\n- Stage clinique dans le cabinet du Dr. Rafael Garcia Espejo à Cordoue en 2008 .\r\n- Stage clinique dans le cabinet du Dr. Ramon Perera Grau à Lleida en 2011.\r\n- Participation aux principaux congrès , symposium , forum sur le système Damon : Barcelone , Malaga , Madrid , Porto , Monaco , Antibes , Cannes ...\r\n- Conférencier aux congrès de Madrid en 2011 et 2013 , Porto en 2014.\r\n- Pratiquant exclusivement la technique Damon depuis 2008 ( plus de mille cas traités ) ."},{"picture_filename":"5824548b8871e_ESPEJO.png","firstname":"Rafael Garcia","lastname":"ESPEJO","title":"Doctor","description":"Ph.D. in Medicine and Surgery, Stomatology Specialist, Master's degree in Orthodontics and Dentofacial Orthopaedics (University of Seville), Professor in Oral Health at the University of Córdoba. Author of various scientific articles, papers and lecturer in conferences, as well as for numerous courses given both nationally and internationally. He has taught the Damon System in Spain, Europe as well as in USA and Latin America. He has shared the podium with Dr. Damon and other distinguished Damon followers in the different Forums held in Palm Springs, California, USA (2006) Monaco (2005, 2006), Barcelona (2007) and Rome (2008). Member of the SEDO (Spanish Society of Orthodontics), AESOR (Spanish Association of Orthodontists), AIO (Latin American Association of Orthodontists), WFO (World Federation of Orthodontists) and Member of the Spanish Division of the Pierre Fauchard Academy. He runs his private clinic in Córdoba, where he started using the Damon System in 2001 and, since the clinical period spent in Dr. Damon's office (Spokane, 2003), he is an exclusive user of that technique.Dr. García Espejo is currently considered one of the pioneers in the System, his experience and prestige being internationally recognized throughout the Damon community. His presence is requested in most forums and meetings organized for the professional dissemination of this technique, not only in Spain and Europe but even intercontinentally (USA, Latin America, Asia). He currently runs and gives, together with Dr. R. Perera, the first European Damon Master, for the introduction, training and in depth study of the technique."},{"picture_filename":"58de5cb600899_14_Dr_Fiorelli-157x157.png","firstname":"Giorgio","lastname":"FIORELLI","title":"Doctor","description":"Laurea in medicina e chirurgia – Università di Siena 1982, Specializzazione in odontostomatologia Università di Siena 1986. Specializzazione in Ortodonzia Università di Siena 2002 Libero professionista con attività limitata all’ortodonzia presso studio professionale in Via Guido Monaco 100 Arezzo Professore a contratto – Scuola di specializzazione in ortodonzia dell’Università di Siena dal 1994 al 2011 – Insegnante allo short term orthodontic course dell’ Università di Aarhus (Danimarca) dal 1992 ad oggi – Docente in corsi privati di biomeccanica ed arco segmentato in Italia, Germania, Polonia, Portogallo, Ungheria e Olanda dal 1991 ad oggi.- Docente e responsabile Master di Biomeccanica e Ortodonzia dell’Adulto, Università di Siena dal 2002 al 2014. Visiting Professor Buffalo Univ. (2012-14). Insegnante al corso di perfezionamento in biomeccanica e tecnica dell’arco segmentato presso l’ Università di Siena negli anni 1991-93 Organizzatore, responsabile e docente della International Orthodontic Biomechanics Summer School, che tiene dal 2013 corsi in Italia per studenti stranieri.\r\nInteressi di ricerca e insegnamento: Biomeccanica ortodontica, Tecnica dell’arco segmentato, Informatica e ortodonzia Ha tenuto corsi e relazioni su invito del comitato organizzatore delle società ortodontiche nazionali italiana, americana, europea giapponese, australiana, polacca, finlandese, greca. Oltre ai corsi e lezioni presso le Università di Siena e di Aarhus (Danimarca) ha tenuto corsi di biomeccanica presso le università di Edmonton Canada, Baylor – Dallas Texas, NYU e Buffalo, NewYork, Philadelphia – Pennsylvania e Chicago – Illinois (USA), Berlino Humboldt, – Germania Goteborg – Svezia e in numerose Università Italiane. Ad oggi 26 pubblicazioni in riviste nazionali e internazionali Autore di “Biomechanics in Orthodontics – Multimedia Learning Software”, attualmente alla 4° edizione (1993-2015) – Coautore in due capitoli di “Adult Orthodontics” Editor B. Melsen – Coautore di “Orthodontics Pearls” Editor L. White, Coautore diel Capitolo “Statically Determined Appliances and Crative Mechanics” in “The Biomechanical Foundation of Clinical Orthodontics” Editors Burstone e Choy. Socio ordinario della SIDO (Società Italiana di Ortodonzia) di cui è stato segretario negli anni 98-99 e consigliere nel 2006-7. Socio EOS (European Orhodontic Society). Socio AAO American Association of Orthodontists, Socio della WFO (World Federation of Orthodontists) Vice presidente della SIBOS nel 2000-2003, (Società Italiana di Biomeccanica e Ortodonzia Segmentata) A partire dal 2009 ha organizzato convegni professionali a scopo benefico, che hanno portato fondi per oltre 40.000 Euro in Brasile, Haiti ed Etiopia, in collaborazione con Save the Children Italia."},{"picture_filename":"57f292cc64bb2_speaker-stuart-frost-2015.jpg","firstname":"Stuart","lastname":"FROST","title":"Doctor","description":"Dr. Frost received his dental degree at the University of the Pacific School of Dentistry and practiced general dentistry for 5 years – two with his father and three in his own office. Following a one-year fellowship in temporomandibular joint dysfunction, he completed a two-year residency in orthodontics and dentofacial orthopedics at the University of Rochester.\r\nDr. Frost practices in Mesa, Arizona. He is currently a part-time associate clinical professor at the University of the Pacific orthodontic program and has lectured on the Damon system at several Damon Forums and other Ormco-sponsored events, including the national American Association of Orthodontists annual session and component meetings and his own Damon in-office seminars.\r\nBy his peers, Dr. Frost has been named one of Phoenix’s top orthodontists for the periods of 2004-2006 and 2008-2010."},{"picture_filename":"5b28d286f293a_Redi Gerxhani.jpg","firstname":"Redi","lastname":"Gerxhani","title":"Dottor","description":"Dr. Redi Gerxhani\r\nLaureato in Odontoiatria e Protesi Dentaria presso l’Università degli Studi “G. D’Annunzio”- Chieti.\r\nSpecializzato in Ortodonzia e Gnatologia presso la Scuola di Specializzazione in Ortognatodonzia della stessa Università.\r\nDa gennaio 2009 al 2012 è Tutor della Scuola di Specializzazione in Ortognatodonzia di Chieti curando l’aspetto clinico e scientifico. \r\nE’ Socio della SIBOS (Società Italiana di Biomeccanica e Ortodonzia Segmentata)\r\nE’ socio della SIDO (Società Italiana di Ortodonzia) \r\nDal 2012  a febbraio 2017 è professore a contratto presso Scuola di Specializzazione Università Degli Sudi di Chieti.\r\nEsercita la libera professione limitatamente all’ortodonzia  in Abruzzo e Puglia.\r\nE’ relatore in corsi e congressi nazionali e internazionali ed è autore di pubblicazioni su riviste internazionali."},{"picture_filename":"57e63ab30235e_marc-geserick.jpg","firstname":"Marc","lastname":"GESERICK","title":"Doctor","description":"Dr. Geserick finished dental school in 2000 followed by clinical trainee ships at the University of Oklahoma, USA, the University of Peradenija, Sri Lanka and the Tsurumi University in Japan. He did his postgraduate studies in Basel and Los Angeles. Dr. Geserick owns a private practice in Ulm, Germany. Dr. Geserick has written several articles and has lectures internationally."},{"picture_filename":"5947aa0ee7f9d_Dr-Abhisek-Ghosh.jpg","firstname":"Abhisek","lastname":"Ghosh","title":"Dr.","description":"Dr. Abhisek Ghosh passed his B.D.S from Ragas Dental College, Chennai (Dr.M.G.R Medical University) as the best outgoing student (Orthodontics),and M.D.S in orthodontics from the prestigious Manipal College of Dental Sciences, Mangalore (Manipal University) as also the Best outgoing student. He is also the recipient of the Best Clinical Poster Award at the 47th Indian Orthodontic Society Conference and 8th APOC, New Delhi, 2012 and the 3rd best paper in Clinical Innovation at the 48th Indian Orthodontic Society Conference, Ahmedabad, 2013. He is also the winner of the George Jacob Award for excellence in clinical innovation presented by the Indian Orthodontic Society in 2014. He is peer reviewer and a member of the editorial board for the Journal of IOS. His clinical work has frequently found place in national and international journals. He was also the Co-Convener scientific committee of the 49th IOC held in Kolkata in the year, 2014 and also the present convener of Orthodontic study group of Newtown, Kolkata."},{"picture_filename":"5c745a5b99129_Dr_Uta_Goenner.jpg","firstname":"Uta","lastname":"Gönner","title":"Dr.","description":"–","link":"www.f3orthodontics.de"},{"picture_filename":"5c745be505f04_Dr_Volkan_Goenner-Oezkan.jpg","firstname":"Volkan","lastname":"Gönner-Özkan","title":"Dr.","description":"–","link":"www.f3orthodontics.de"},{"picture_filename":"5a44cd26d17e8_DGZ.jpg","firstname":"David","lastname":"GONZALEZ ZAMORA","title":"Doctor","description":"Dr. David Gonzalez received his dental degree at the European University of Madrid (UEM). Subsequently, he completed a Master's Degree in Orthodoncy and Dentofacial Orthopaedics at the Mississippi Univesitary Institution. He has been a Professor at the Alfonso X El Sabio University Orthodontics Master's Degree  in Madrid for six year (2005-2011), as well as Professor at the Orthodontics Master's Degree of the European University of Madrid (2009-2012). For the past nein years (2002-2011) he has been the President of New Technologies Committe at the Official College of Odontologists and  Stomatologist of the 1st Region. He also has a great experience as a speaker at international and national conferences."},{"picture_filename":"5c792990e079f_gruszka-157x157.png","firstname":"Katarzyna","lastname":"Gruszka","title":"Dr.","description":"Dr n. med. Katarzyna Gruszka w 2011 roku ukończyła studia na kierunku lekarsko-dentystycznym Uniwersytetu Medycznego w Lublinie. W 2017 obroniła doktorat z radiologii stomatologicznej. Do 2018 roku pracowała w Zakładzie Rentgenodiagnostyki Stomatologicznej i Szczękowo-Twarzowej UM w Lublinie jako asystent akademicki pisząc wiele prac naukowych i ucząc studentów radiologii stomatologicznej.\r\nRadiologia od zawsze była dla niej szczególnym przedmiotem zainteresowania.\r\nPołączenie ortodoncji i radiologii stanowi wyzwanie ale również daje dużą satysfakcję.\r\nPrywatnie pływa na windsurfingu, gra w squasha i uwielbia czytać książki."},{"picture_filename":"5c73fff3f2793_Dr_Gabriele_Guendel.jpg","firstname":"Gabriele","lastname":"Gündel","title":"Doctor","description":"Kieferorthopädie und Lingualtechnik im Lehel\r\n Für Kinder, Jugendliche und Erwachsene\r\nIn enger Zusammenarbeit mit Logopädie, Osteopathie und Physiotherapie"},{"picture_filename":"57e63f9a890f1_Gurkeerat Singh.jpg","firstname":"Singh","lastname":"GURKEERAT","title":"Professor","description":"Professor.Gurkeerat Singh has Bachlor of Dental Surgery from college of Dental Surgery, Mangalore. Mangalore University (1989-   1994) and Master of Dental Surgery(Orthodontics)from College of Dental Surgery, Mangalore. Manipal Academy of higher education, Manipal (January 1997).\r\n\r\nDiplomat, Indian Board of Orthodontics, November 2009 \r\n\r\nProfessor Gurkeerat is in private practice in New Delhi since 1997, a consultant Orthodontist in Indian Spinal Injuries Centre and Hospital, Vasant Kunj, New Delhi. Attached since August 1998 and serving till date.\r\n and, Former consultant Orthodontist, Mata Channan Devi Hospital, Janakpuri, New Delhi. \r\n\r\nSudha  Rustagi College of Dental Sciences and Research, Faridabad (March 2005-April 2006)\r\n Harsarn Dass Dental College, Ghaziabad (April 2004-March 2005).\r\n Reader Harsarn Dass Dental College, Ghaziabad (April 2003-March 2004). \r\n Rama Dental College Hospital & Research Centre, Kanpur (April 2001- March 2003)\r\n\r\nSenior Lecturer Rama Dental College Hospital & Research Centre, Kanpur (March 1998- March 2001)\r\n\r\n• Life member, Indian Orthodontic Society (IOS).\r\n• Life member, Indian Society of Dental Research (ISDR).\r\n• Life member, Indian Academy of Orofacial Genetics.\r\n• Life member, Academy of Oral Implantology (AOI).\r\n• Life member, Society for Oral Laser Applications (SOLA).\r\n• Member, Indian Dental Association (IDA).\r\n• Member, German Society of Oral Implantology."},{"picture_filename":"590300b502a88_FIRAS2.jpg","firstname":"Firas","lastname":"HAMZEH","title":"Doctor","description":"Dr. Firas Hamzeh started his postgraduate training program at the University of Nantes -France in 1994.\r\n\r\nHe obtained his first certificate of advanced studies in dental materials used in dentistry in December 1995 and his certificate of high studies in dento facial orthopedics in 1997 \r\n\r\nAt the same university, while he was studying this certificate he started his diploma in orthodontics in 1996 and he obtained his Masters in 1999.\r\n\r\nDr Hamzeh moved to Dubai in 2000 and he started his practice in the private sector , he started to use the self-ligating brackets with the Damon system in the year 2004 and he continued his advanced training with Damon system with best ormco’s educators then he became an exclusive user of Damon system in his practice Since the year 2008 ,\r\n\r\nHe’s one of KOL with Damon system and Insignia in the Middle East.\r\n\r\nDr. Firas Hamzeh had advanced knowledge in Orthodontic digital solutions   Dr. Hamzeh is recognized as an early adopter and advocate of innovative orthodontic systems including aligners and digital custom brackets INSIGNIA BRACES (he was also the first Insignia user in the UAE) his first case was in 2012 .in addition to being KOL (key opinion leader) for ORMCO and an international Ormco speaker.\r\n\r\nIn addition to this he loves to treat the TMD cases because he has been following a lot of training program in occlusion and TMJ including the ROTH Williams philosophy.\r\n\r\nHe completed his postgraduate training program in TMJ, occlusion and orthodontics – San Sebastian, Spain. \r\n\r\nSince 2013 he’s treating patients with temporomandibular joint disorders\r\n\r\nDr. Hamzeh has presented in so many international orthodontic conferences, his main focus in his lectures is the digital orthodontics and the Damon system."},{"picture_filename":"5b8e7061e3b6a_Casper Hansen Round.png","firstname":"Casper","lastname":"Hansen","title":"Dental Hygienist","description":"Damon"},{"picture_filename":"5c74454467cf0_Dr_Markus_Heise.jpg","firstname":"Markus","lastname":"Heise","title":"Doctor","description":"Dr. Heise is a very experienced clinician and is now holding in office courses, teaching all the benefits of the Damon System. Within his course he also gives the Dr’s the chance to see a live bond up by using a video link from the dental chair to a seminar room. By working with typodonts, Dr. Heise teaches Dr’s the step by step process of the mechanics of the Damon System. Owns the Haranni akademie.","link":"ww.kfo-heise.de"},{"picture_filename":"5902fdb466cd5_HERRADINE.jpg","firstname":"Nigel","lastname":"HERRADINE","title":"Doctor","description":"Nigel Harradine qualified from Guys Hospital, London in 1971 and was then a house surgeon at Guys before undertaking his undergraduate medical training, qualifying again from Guys in 1975. A medical house physician post followed at Guys and then a year as an intern in London, Ontario before he settled on orthodontics as his chosen speciality and returned to the United Kingdom. A year of full-time general dental practice was followed by the two-year orthodontic course at the Royal Dental Hospital, London and Kingston Hospital, Surrey. In 1981, Nigel went to the Eastman Dental Hospital, initially as a lecturer and then as a senior lecturer in orthodontics. Since 1984 he has been a consultant at Bristol Dental Hospital and School where he is in charge of the undergraduate program and fully involved in the postgraduate teaching.\r\n\r\nParticular clinical interests have included:\r\n\r\n-the use of computers for planning and recording the effects of treatment and for storing \r\n -digital clinical records \r\n -functional appliances \r\n -the Straight-Wire Appliance pre-adjusted edgewise appliances \r\n -self-ligating brackets \r\n -the effects of orthognathic surgery"},{"picture_filename":"5c73fdf354c83_Heike_Herrmann.jpg","firstname":"Heike","lastname":"Herrmann","title":"–","description":"– Seit 1993 freie und unabhängige Referentin für zahnärztliches Praxismanagement","link":"www.kfo-profi.de"},{"picture_filename":"58e7930b088b1_Dr_Barry_Hoffman-157x157.png","firstname":"Barry","lastname":"HOFFMAN","title":"Doctor","description":"Certified Specialist in Orthodontics and Dentofacial Orthopedics\r\nDiplomate, American Board of Orthodontics\r\n\r\nEducation\r\nHenry Ford High School, 1968, Detroit, Michigan\r\nUniversity of Michigan, Literature, Science, and Arts, 1968-1970\r\nUniversity of Michigan School of Dentistry, 1970-75, Doctor of Dental Surgery, 1975\r\nUniversity of Minnesota School of Dentistry, 1975-77, Clinical Certificate in Orthodontics, 1977\r\nUniversity of Minnesota Graduate Studies, 1975-77, Masters of Science, Anatomy, 1977\r\nBoard Certification\r\nNortheast Regional Dental Boards, 1975\r\nCentral Regional Dental Boards, 1975\r\nAmerican Board of Orthodontics, 1988\r\n\r\nLicensure\r\nProvince of Alberta, 1977 to present.\r\nState of Michigan, 1975 to 2011\r\n\r\nOrganizations\r\nCanadian Dental Association, Alberta Dental Association, Calgary and District Dental Society\r\nCanadian Association of Orthodontists, Alberta Society of Orthodontists\r\nAmerican Association of Orthodontists, Pacific Coast Society of Orthodontists\r\nCollege of Diplomats, American Board of Orthodontics\r\nAlpha Omega Dental Fraternity\r\n\r\nPositions Held\r\nAlberta Society of Orthodontists: All executive positions.\r\nCanadian Association of Orthodontists: Annual Program Chairman\r\nAmerican Association of Orthodontists, Alternate Delegate\r\nPacific Coast Society of Orthodontists, Executive Board, By-Laws Committee Chair\r\nAlpha Omega Dental Fraternity, President of Undergraduate and Alumni Chapters\r\nPublications:   Indirect Bonding, Journal of Clinical Orthodontics, August 1988\r\nVisiting Lecturer and Clinical Instructor at the University of Alberta"},{"picture_filename":"590301035bd9e_HORN2.png","firstname":"André","lastname":"HORN","title":"Doctor","description":"Born in Lille (FRANCE) in 1945.\r\nDental School in Lille from August 1964 to 1968.\r\nImmigration to CANADA in July 1968.\r\nResuming Dental studies to get equivalence in the University of\r\nMontreal (Quebec): from 1968 to 1971.\r\n1971: obtained DDS.\r\nStarts right away Orthodontic specialty in August 1971. Trained\r\nin the Segmented Arch Technique of Dr. Charles BURSTONE.\r\nInterrupted specialty in March 1973 to comply with French military\r\nobligation.\r\nJuly 1974: resumed the whole Orthodontic course program\r\n(2 years).\r\n1976: Specialty in Orthodontics completed: Certifi cate in\r\nOrthodontics.\r\nIn full time practice since then.\r\n1990-1992: Took 2 years in Osteopathy - (Full course takes 5 years).\r\n1995: Course in Posturology.\r\nMember of the Progressive Study Club directed by Dr Tom PITTS!\r\nInternational lecturer for Ormco."},{"picture_filename":"58ecda3eda24e_07_LUIS_HUANCA-157x157.png","firstname":"Luis","lastname":"HUANCA GHISLANZONI","title":"Doctor","description":"Titulaire d’un diplôme d’orthodontie de l’Université de Milan (Università degli Studi di Milano) en 2006, le Dr Luis Huanca Ghislanzoni a suivi, la même année, le Short-Term Orthodontic Program de l’Université Aarhus au Danemark. Il s’est spécialisé dans l’orthopédie dento-faciale à l’Université de Milan en 2009, où il a également obtenu son Doctorat en 2013. Il a ensuite déménagé en Suisse, où il exerce principalement sous le statut de professionnel libéral à Lausanne et Neuchâtel. Il collabore avec l'Université de Genève en tant que chercheur à temps partiel, au sein du département d’orthodontie du Professeur Kiliaridis. Il continue également de collaborer avec le cabinet familial situé à Albino (province de Bergame en Italie).\r\nIl a de nombreuses publications dans des revues internationales à son actif. Il est souvent invité comme intervenant dans le cadre de congrès et de Masters d’orthodontie au sein des universités italiennes, ainsi qu’à l’étranger.\r\nEn 2015, il a fondé Orthogeek avec son ami le Dr Berardinelli. Il s’agit d’un groupe Facebook qui propose un calendrier en ligne des principaux événements académiques dans le domaine de l’orthodontie en Italie et dans le reste du monde.\r\nDepuis 2017, il tient un blog (http:\/\/luishuanca.info\/the3dorthodontist\/) à travers lequel il partage son expérience de la pratique entièrement numérique depuis quelques années, dans le but d’encourager ses collègues et de les inciter à tirer profit au maximum des avantages que présentent les nouvelles technologies pour les orthodontistes et leurs patients."},{"picture_filename":"5d97111de6567_Dr JOSEPH.jpeg","firstname":"Guillaume","lastname":"JOSEPH","title":"Docteur","description":"Docteur en chirurgie dentaire \r\nSpécialiste qualifié en orthopédie-dento-faciale \r\nDiplôme Universitaire d’Orthodontie Lingual Paris V \r\nCertification en Technique incognito et invisalign\r\nInstructeur certifié Damon\r\nMembre Titulaire CEO et SFODF\r\nPast président de la Société Française d’orthodontie linguale\r\nCo-fondateur de l’académie d’orthodontie\r\nExercice privé"},{"picture_filename":"5980376f1c730_Dr. Anmol Kalha.png","firstname":"Anmol","lastname":"Kalha","title":"Dr.","description":"Professor Emeritus , Distinguished Professor and Chief Mentor , Principal Consultant and Advisor , Max health Care , Chief architect and mentor JSM Smart health Analytics\r\n\r\nGraduated with a University roll of Honor, Gold medal and academic achievements in 1976, Commissioned into the Army Dental Corps, and has served with distinction both in India and abroad. Selected for deputation to the Sultanate of Oman in 1983, was also appointed as Liaison officer with the Indian embassy for all bilateral matters pertaining to the armed forces. Awarded the Order of the Special Royal Emblem by Sultan of Oman for distinguished services in 1986. Received his Masters degree (MDS) from AFMC with highest possible grades, recipient of the General Master Memorial Silver Medal, served as a classified and senior specialist in various flagship establishments and published both military and professional papers.\r\n\r\nHas since been on the forefront in Academics, Clinical Practice, Healthcare administration and is an International key opinion leader and consultant .Has lectured and taught extensively over South America, USA, UK, Europe, West Asia, SE Asia, China, Japan, Australia, New Zealand, Brazil,Latin America. He has trained in Germany in lingual orthodontics at the Karl Eberhardt University in 2000 and has taught lingual orthodontics globally. He received advanced instructional training in Lingual Orthodontics (Incognito) in 2010 in Bad Essen Germany and is an international key opinion leader. He has has been involved in consultancy, product development and clinical strategy for 15 years .has been a part of the Evidence Based health Initiative since 2000 and has been actively involved with EBD UK. Has been involved with national health care \/ education policy and planning, made presentations to the Planning Commission, National Knowledge Commission and the Ministry of Health and Family welfare, GOI, WHO.Member of the National Council on Clinical Establishments.\r\n A Professor Emeritus at one of the most prestigious institutions in the National capital region, he is also a distinguished professor and chief mentor at a leading institution in southern India .a principal Consultant and Advisor to one of the most prestigious health care groups in India.He is also involved in developing health care analytics for hospital services. He is accredited to practice in Dubai and has a consulting practice in India and abroad .Has chaired the Diplomate of the National Board of Examinations several times , examiner to several universities , has guided over 200 post graduate dissertations , been a consultant to industry , is on the editorial board of several prestigious international journals ; EBD UK , EAPD , responsible of setting up the first dedicated evidence based dentistry centre in SE Asia in 2000.\r\n\r\nHe has written and published extensively, is on the editorial board of several prestigious International journals and has a specific interest in Evidence based health care. He has a special interest in Adult Orthodontics, TADS, Aesthetic Orthodontics and early treatment. He received a Lifetime Achievement award at the FDI SFDS for contributions to Military Dentistry and Oral Health Sciences. He has the distinction of lecturing , teaching in 41 countries around the globe."},{"picture_filename":"5903017e70f6d_KAMMERMAN2.png","firstname":"Arthur","lastname":"KAMMERMAN","title":"Doctor","description":"Dr. Kammerman graduated with honors from the Indiana School of\r\nDentistry where he was inducted into the Omicron Kappa Upsilon dental\r\nhonors society. He received his post doctoral Orthodontic training with\r\nhonors at the University of Maryland School of Dentistry and is a Diplomate\r\nof the American Board of Orthodontics. In private practice since 1985 in\r\nGarden City, Long Island, Dr. Kammerman has been an exclusive Damon\r\npractitioner for ten years. He is a native New Yorker and currently resides in\r\nBrookville, Long Island with his wife Marsha."},{"picture_filename":"57e9419defdc3_jeff-kozlowski.jpg","firstname":"Jeff","lastname":"KOZLOWSKI","title":"Doctor","description":"Dr. Kozlowski has been setting the highest standards of excellence in orthodontics for over a decade.  He graduated magna cum laude from SyracuseUniversity in 1992, earning a Bachelor of Science Degree in Economics. He obtained his Doctor of Dental Surgery degree in 1996 from the State University of New York at Buffalo School of Dentistry where he also completed a residency in Orthodontics and Dentofacial Orthopedics, graduating in 1998. \r\n\r\nDr. Kozlowski is a member of many leading orthodontic and dental organizations, including the American Dental Association, American Association of Orthodontists, and the Connecticut State Dental Society. He has been published in several orthodontic journals, including Seminar in Orthodontics, the Journal of Clinical Orthodontics, and Clinical Impressions. \r\n\r\nAs a certified Damon System educator and a lead developer of Insignia custom braces, Dr. Kozlowski has become an internationally sought after speaker. He lectures extensively to orthodontists all over the world on various topics, including efficiency and excellence in orthodontics, early treatment, facial esthetics, and computerized custom braces. He has made presentations at meetings hosted by the American Association of Orthodontists, Northeast Society of Orthodontics, Massachusetts Society of Orthodontics, North American Damon Forum, as well as numerous other dental societies, universities, study clubs and alumni organizations."},{"picture_filename":"5c41a593bd7cf_IMG_9907.JPG","firstname":"Miguel Angel","lastname":"Leal","title":"Dr.","description":"– Licenciado en Odontologia por Universidad Complutense .2003-2007\r\n\r\n– Curso de Especializacista en Ortodoncia Fija Y funcional en CEOSA. 2006-2007\r\n\r\n– Master  Oficial en Ortodoncia Avanzada en UEM. 2008-2011\r\n\r\n– Título Universitario de Especialista en Odontología Éstética y Rehabilitadora. 2015\r\n\r\n– Master en  Técnica Damon. 2016\r\n\r\n– Master Avanzado en Técnica Invisalign ( Dr Manuel Roman). 2017\r\n\r\n– Profesor Adjunto en Certificado Europeo de Ortodoncia UEM.\r\n\r\n– Ortodoncista Certificado en sistemas de Ortodoncia digital: Insignia e Incógnito.\r\n\r\n– Curso Minitornillos ( Dr. Chris Chang)\r\n\r\n– Miembro de diferentes sociedades científicas: Sociedad Española de Ortodoncia (SEDO) , Sociedad Española de Alineadores(SEDA) y SEPES.\r\n\r\n– Práctica Privada en Clínica Leal en Daimiel ( Ciudad Real)."},{"picture_filename":"59cbbd1c98f29_claude.jpg","firstname":"Claude","lastname":"LEMASSON","title":"Docteur","description":"Spécialiste certifié en orthopédie dento-faciale,\r\na obtenu son diplôme du conseil français d’orthodontie.\r\nIl est président du GREAT (Group Root Edgewise\r\nAdvanced Technique) et il est également secrétaire\r\ngénéral d’ELITE (European Lingual Innovative\r\nTechnique and Education).\r\nLe Dr Lemasson enseigne en Europe, au Maroc\r\net au Moyen-Orient."},{"picture_filename":"596b0a952bb55_Dr_John_Lin photo 2016.jpg","firstname":"John","lastname":"Lin","title":"Dr.","description":"Dr. Lin is a clinical professor in the Department of Orthodontics at Taipei\r\nMedical University, is a past president of the Taiwan Association of\r\nOrthodontists, and maintains a private orthodontic practice. Dr. Lin has\r\npublished “Creative Orthodontics, Blending the Damon System and TADs to\r\nManage Difficult Malocclusions.”, 1st edition 2007, 2nd edition 2010. “Class\r\nIII Correction Orthodontics”, 1st edition 2013.\r\nM.S and Certificate in Orthodontics, Marquette University (USA)\r\n(Orthodontic Graduate Program) 2000~2002: President of the Taiwan\r\nAssociation of Orthodontists 2004~present: Clinical Professor, Taipei\r\nMedical University (Orthodontic Department) Director of Lin’s Orthodontic\r\nCenter Senior consultant of Taiwan Orthodontics Society Senior consultant\r\nof Taiwan Association of Orthodontics."},{"picture_filename":"5947a575ae2ac_Dr-Aravind-M.jpg","firstname":"Aravind","lastname":"M","title":"Dr.","description":"Dr. Aravind graduated from College of Dental Sciences, Davangere and has more than 8 years of post-graduate teaching experience at KLE Society’s Institute of Dental Sciences, Bangalore.\r\n\r\nHe is also associated with Confident digital dental laboratory and Ormco India, and has undertaken research in the field of digital applications in Lingual Orthodontics. He has delivered several lectures with special emphasis on biomechanics in lingual orthodontics and effective usage of STB light lingual brackets.\r\n\r\nHe has been an invited speaker at national conferences and several CDE programs. He has several International and national publications to his credit."},{"picture_filename":"5e16fc5397d63_dr-ivan-malagon-157x157.png","firstname":"Iván","lastname":"Malagón","title":"Dr.","description":"Doctor español- especialista en la técnica Spark"},{"picture_filename":"57ee9421ef10a_Gualtiero_Mandelli.jpg","firstname":"Gualtiero","lastname":"MANDELLI","title":"Doctor","description":"Dr. Gualtiero Mandelli graduated in Medicine and Surgery from University of Study of Milan in 1985. After the graduation, he achieved three post-graduate specializations in: Orthodontics, Stomatology and Pediatrics in the same University. He was Visiting Professor in Orthodontics at University of Parma from 2003 to 2010 and from 2011 he is Visiting Professor at Specialization School in Orthodontics at University of Brescia. His private practice is in Lombardia. He is member of SIDO from 1995. Dr. Mandelli is also author of various scientific works and has given talks and presentations at numerous courses and congresses. In the last four years, he has dedicated his Orthodontic Biomechanics research, in particular, to the use of phase auxiliaries in order to increase the clinical efficiency of base set up in phase 1 and phase 2."},{"picture_filename":"57e63c61cb097_dimitris-mavreas.jpg","firstname":"Dimitris","lastname":"MAVREAS","title":"Doctor","description":"Doctor Dimitrios Mavreas is currently a Clinical Professor at Vrije University in\r\n Brussels, Belgium, and maintains a private practice in Athens, Greece. He is\r\n also affiliated to the Hellenic Craniofacial Center, Athens, Greece, treating\r\n craniofacial anomaly and cleft patients.\r\n He completed his orthodontic training at the Department of Orthodontics,\r\n Aarhus, Royal Dental College, Denmark, (Master of Science Degree), and\r\n also had postgraduate training in Occlusion and TMJ Management at the  Department of Occlusion, Georgetown University School of Dentistry, Washington DC, USA. In addition he holds a PhD degree from the University of Athens, School of Dentistry, Greece.\r\n He has worked as an Assistant Professor at the Department of Orthodontics in Aarhus, Denmark.\r\n He has published numerous articles in various orthodontic journals. He has  been lecturing extensively on the Damon system and various other topics."},{"picture_filename":"5a665b40d8f59_Dr_Mayhew_Mike.jpg","firstname":"Mike","lastname":"Mayhew","title":"Dr.","description":"Mike Mayhew, DDS, MS, received his dental education at the University of North Carolina with specialty degrees in pediatric dentistry and orthodontics. He is board certified in both specialties and operates a dual-specialty practice in Boone and North Wilkesboro, North Carolina. Dr. Mayhew has lectured nationally and internationally on the Damon™ System, CAD-CAM digital orthodontics, indirect bonding, and office utilization of CBCT. He is on the Sports Medicine Team at Appalachian State University, is an adjunctive clinical professor at the UNC School of Dentistry, has held leadership positions in organized dentistry, and serves as the director of the North Carolina\/South Carolina Damon Study Club. He was inducted into the American College of Dentists in 2010 and the International College of Dentists in 2013."},{"picture_filename":"5c7521f1b6c92_Dr_Elizabeth_Menzel.jpg","firstname":"Elizabeth","lastname":"Menzel","title":"Doctor","description":"B.Ch.D.University Stellenbosch. Orthodontic training at the university of Frankfurt, training in the practice of Praxis Dr. Toll in Bad Soden, Germany and with Prof. Axel Bumann in Kiel with an emphasis on jaw diseases and how to treat them. Works at the Gemeinschaftspraxis in Herrsching am Ammersee, Germany since 15 years.  Also works in Great Britain and Vilnius, Lithuania for the orthodontic treatment of patients with severe jaw diseases. Internationally recognize lecturer since 2006. Damon user since 2003.","link":"www.elizabethmenzel.de"},{"picture_filename":"58de5c57f3150_14_Dra_Merlo-157x157.png","firstname":"Paola","lastname":"MERLO","title":"Doctor","description":"Laureata in odontoiatria, Specializzata in Ortognatodonzia all’Università del’Insubria (2004) Ha frequentato il reparto di Ortognatodonzia dell’Università di Siena tra il 2009 e il 2012 dove ha completato il master in “Ortodonzia del paziente adulto”., discutendo la tesi finale dal titolo “Riposizionamenti Mandibolari nel Paziente Adulto”. Lavora come ortodontista nei suoi studi privati a Lugano (CH) e Luino (VA). Socio Ordinario della SIDO e della SIBOS. Ha collaborato come insegnante ai corsi di biomeccanica del Dr. Giorgio Fiorelli\r\n in Italia e all’estero (USA, Portogallo, Polonia, Svezia ) a partire dal 2011. E’ stata invitata come speaker al XIV congresso Panellenico. Ha partecipato come relatrice ai convegni\r\n Melsen & Friends (2010) e Burstone & Friends (2012). Autrice di due pubblicazioni in campo ortodontico. Ha contribuito al libro “Orthodontic Pearls” di Larry White, è stata Coautore nel Capitolo “Statically Determined Appliances and Crative Mechanics” in “The Biomechanical Foundation of Clinical Orthodontics”"},{"picture_filename":"5a6644773b14f_Mr_Miroshnichenko_Alex.jpg","firstname":"Alex","lastname":"Miroshnichenko","title":"Mr.","description":"As Ormco’s Senior Manager of Digital Marketing, Alex Miroshnichenko is responsible for all aspects of Ormco’s worldwide electronic activities. He directs multiple websites, including e-commerce, doctor locators, blogs, mobile applications, pay-per-click, banner and Facebook advertising, email campaigns, search engine optimization (SEO), social media and advanced analytics. With 16+ years experience in the field, Mr. Miroshnichenko’s background includes work experience with E*TRADE, American Automobile Association (AAA) and Toshiba Medical. He has been featured in The Wall Street Journal, Business Week and Fortune as well as on CNN, Fox News, MSNBC and CNET on leveraging blog and social media platforms."},{"picture_filename":"5903051a6d95c_mota2.jpg","firstname":"Carlos","lastname":"MOTA","title":"Doctor","description":"Médico Dentista\r\n Especialista em ortodontia pela O.M.D.\r\n Presidente da S.P.O. de 1998 a 2002"},{"picture_filename":"5c754718c233a_Dipl_Med_Michael_Mueller.jpg","firstname":"Michael","lastname":"Müller","title":"Dipl.-Med.","description":"–","link":"www.kfo-muellermi.de"},{"picture_filename":"5e591e5066255_Dr_Bashar_Muselmani_2020.jpg","firstname":"Bashar","lastname":"Muselmani","title":"Doctor","description":"1976–1981 Studium der Zahnmedizin (Damascus University)\r\n1981 Approbation als Zahnartz (DDS)\r\n1981–1983 Fachzahnarztausbildung und Anerkennung für FZA fürParodontologie (Damascus University)\r\n1984–1989 Weiterbildungsassistent für Kieferorthopädie – Promotion ander FSU (Friedrich Schiller Universität) Jena\r\n1989 Anerkennung zum Fachzahnarzt für Kieferorthopädie (Berlin) mitdem Titel Dr. med.\r\n\r\nBeruflicher Werdegang\r\n1992–2008 Hochschullehrer, Prodekan, Dekan, Abteilungsleiter fürKieferorthopädie and der Tishreen University (Latakia, Syria)\r\n2001 Anerkennung zum Universitäts-Professor in der Kieferorthopädiean der Tishreen University\r\n01.2011 bisheute: Consultant of Orthodontics in Ramstein DentalCare, Schwerpunkt Damon-System\r\nNationale & internationale Referententätigkeit\r\nMitglied DGKFO"},{"picture_filename":"5c7948a0e8b20_Dr_stanislaw_musial-157x157.png","firstname":"Stanisław","lastname":"Musiał","title":"Dr n. med.","description":"Dr Stanisław Musiał ukończył studia na Wydziale Lekarsko-Dentystycznym Śląskiego Uniwersytetu Medycznego w Katowicach w roku 1993.\r\nW roku 1996 zdał egzamin specjalizacyjny I stopnia z zakresu stomatologii ogólnej. W 2003 zdał egzamin specjalizacyjny z ortodoncji.\r\nW dniu 25 października 2016 r. Stanisław Musiał obronił pracę doktorską pt. „Zmiana nachylenia kłów stałych szczęki\r\nw wieku rozwojowym u pacjentów poradni ortodontycznej”. Uzyskał tym samym tytuł doktora nauk medycznych.\r\nPublikuje prace w czasopismach polskich, bierze czynny udział w konferencjach i zjazdach krajowych oraz międzynarodowych."},{"picture_filename":"5d97116d34f90_Dr NICOLAS.JPG","firstname":"Sébastien","lastname":"NICOLAS","title":"Docteur","description":"Docteur en chirurgie dentaire\r\nSpécialiste qualifié en orthopédie dento-faciale\r\nMembre de la Société Française d’orthopédie dento-faciale.\r\nMembre Titulaire CEO et SFODF\r\nInstructeur certifié Damon.\r\nCertification en Technique incognito et invisalign.\r\nExercice privé"},{"picture_filename":"57bb0595abb0f_timthumb-1.php.jpeg","firstname":"Patrice","lastname":"NICOLLEAU","title":"Doctor","description":"Doctorat en chirurgie dentaire UFR Odontologie Nantes 1980\r\nCES de biochimie Faculté de sciences nantes 1977\r\nCES de psycho-physiologie Faculté de sciences nantes 1980\r\nCES parodontologie UFR Odontologie Nantes 1980\r\nDiplôme d’Etudes et de Recherche en Sciences Odontologiques nantes 1985\r\nSpécialiste Qualifié en Orthopédie Dento-Faciale Nantes 1985\r\nDoctorat de 3e en sciences odontologiques Nantes 1990\r\nD.U. de parondontologie et d’occlusodontie nantes 1994\r\nChargé de cours en occlusodontie Nantes 1993-1998\r\nInstallation Spécialiste en orthopédie dento-faciale Cholet 1985\r\nCréation Laboratoires innova pharm cholet juin 2000"},{"picture_filename":"5c7554ba00bc2_Prof_Dirk_Nolte.jpg","firstname":"Dirk","lastname":"Nolte","title":"Prof. Dr. Dr.","description":"–","link":"www.mkg-muc.com"},{"picture_filename":"57b5eac4ebd71_bernard_nourry.jpg","firstname":"Bernard","lastname":"NOURRY","title":"Doctor","description":"Thèse de Docteur en Chirurgie\r\nDentaire à NANTES en 1987.\r\nSpécialité en Orthodontie 1991\r\nNANTES.\r\nCertificat Orthodontie Linguale\r\nDr FILLION en 1991.\r\nCertificat Orthodontie Linguale\r\nWIECHMANN en 2002, puis\r\nINCOGNITO en 2003.\r\nCertificat DAMON INSTRUCTOR\r\n2005 , Speaker DAMON et\r\nanimateur Study Group depuis\r\ncette date.\r\nEnseignant Clinique du DU\r\northodontie linguale de RENNES\r\ndepuis 2006.\r\nDU européen de dentisterie\r\nassistée Laser ( PARIS VII) 2015.\r\n\r\n- Docteur en Chirurgie Dentaire.\r\n\r\n- Spécialiste Qualifié en Orthopédie Dento-faciale.\r\n\r\n- Diplôme Universitaire d'Orthodontie Linguale.\r\n\r\n- Attaché à la Faculté d'Orthodontie. \r\nDiplômé du CECSMO de NANTES.\r\n\r\n- Pratique du système Damon depuis 2003. \r\nIntervenant Study Group DAMON."},{"picture_filename":"5c80cd9176eba_rn-foto-157x157.png","firstname":"Rafał","lastname":"Nowak","title":"Dr n. med.","description":"Dr n. med. Rafał Nowak - specjalista chirurgii szczękowo-twarzowej\r\nStudia na Wydziale Lekarskim z Oddziałem Stomatologii Akademii Medycznej im. Piastów Śląskich we Wrocławiu ukończył w 2000 roku.\r\nOd 2003 roku jest pracownikiem Katedry i Kliniki Chirurgii Szczękowo-Twarzowej UM we Wrocławiu oraz Uniwersyteckiego Szpitala Klinicznego we Wrocławiu.\r\nOd 2014 roku konsultant z zakresu chirurgii szczękowo – twarzowej Uniwersyteckiego Szpitala Klinicznego w Zielonej Górze.\r\nWspółtwórca i współwłaściciel prywatnej praktyki Centrum Chirurgii i Estetyki Twarzy we Wrocławiu współpracującej w obszarze zabiegowym z najnowocześniejszym na Dolnym Śląsku centrum medycznym Medicus Clinic.\r\nJest współautorem 79 prac naukowych i doniesień zjazdowych z zakresu chirurgii szczękowo-twarzowej opublikowanych w czasopismach naukowych oraz przedstawionych na konferencjach międzynarodowych i krajowych.\r\nWykładowca i organizator kursów specjalistycznych z zakresu chirurgii szczękowo-twarzowej i chirurgii ortognatycznej oraz uczestnik licznych kursów doskonalących z zakresu chirurgii jamy ustnej, szczękowo-twarzowej, ortodoncji i implantologii.\r\nZainteresowania praktyczne obejmują szeroko pojętą chirurgię kostną w zakresie części twarzowej czaszki i jamy ustnej, zabiegi rekonstrukcyjne przedprotetyczne i przedimplantologiczne, chirurgię ortognatyczną, traumatologię czaszkowo-szczękowo-twarzową oraz zastosowanie technologii 3D w planowaniu zabiegów operacyjnych.\r\nUczestnik staży klinicznych w renomowanych ośrodkach chirurgii szczękowo-twarzowej m. in. w Brugii, Antwerpii, Munster, Dreźnie, Mediolanie. Członek i stypendysta European Association for Cranio-Maxillo-Facial Surgery, stypendysta Funduszu im. E. Niedźwirskiego oraz członek Polskiego Towarzystwa Chirurgii Jamy Ustnej i Chirurgii Szczękowo Twarzowej.\r\nPrywatnie pasjonat deski w każdym wydaniu – na śniegu, wodzie i kółkach, MTB, gór i zdrowego stylu życia."},{"picture_filename":"5ab2f60bebb12_Dr_Olsen_Marc-1x1.3.jpg","firstname":"Marc","lastname":"Olsen","title":"Dr.","description":"Dr. Olsen received his dental degree from the University of Iowa.  Following one-year Advanced Education in General Dentistry focused on complex patient prosthetic care, he completed a four-year dual-specialty program at Indiana University in Prosthodontics and Orthodontics and Dentofacial Orthopedics along with his Masters’ degree in Dental Science.  He has authored\/coauthored over 18 published journal articles and presented his research at National Dental conferences.  Following graduation from Indiana University, he opened his private practice in Montana.  He currently maintains private practices in Central Montana and Central Wyoming.  He has been an exclusive provider of the Damon System since 2007."},{"picture_filename":"5c74ff5f5b710_Dr_Jan_Opitz_.jpg","firstname":"Jan-Philip","lastname":"Opitz","title":"Dr.","description":"–","link":"www.drdux.de"},{"picture_filename":"58da642b25f3f_Sonia-Palleck.jpg","firstname":"Sonia","lastname":"PALLECK","title":"Doctor","description":"•Member of many associations including the American Association of Orthodontists, the Canadian Association of Orthodontists, the Ontario Dental Association, and the Royal College of Dentists of Canada."},{"picture_filename":"57ee94dc92337_darsh_patel_t.jpg","firstname":"Darsh","lastname":"PATEL","title":"Doctor","description":"Dr. Darsh Patel obtained his degree in Dentistry from the University of Manchester, and postgraduate in Orthodontics at Birmingham Dental Hospital. He runs a multi-award winning, 100% private practice in London, United Kingdom solely utilising self ligating buccal appliances. With nearly a decade of utilising the Damon system and other self ligating appliances, Darsh is hugely enthused by the positive changes modern brace systems have brought to orthodontic treatment. He is a key opinion leader of a number of orthodontic appliances and lectures upon various orthodontic techniques locally, nationally and internationally."},{"picture_filename":"5a44ce77c4a3a_DR PERERA .jpg","firstname":"Ramon","lastname":"PERERA","title":"Doctor","description":"Dr. Perera obtained his degree in Medicine and Surgery from the University of Barcelona in 1981 and then went on to complete his studies in Stomatology in 1983. In 1986, he completed postgraduate studies in Orthodoncy at the Centro Europeo de Ortodoncia in Madrid. From 1995 to 1997 he then completed a further series of studies with the Roth-Williams Centre. R. Perera has been a member of SEDO since 1991 and is also a member of AESOR, AIO and WFO. He is the author of various scientific articles and has given talks and presentations at numerous courses and congresses. Dr. Perera was a pioneer in the introduction of the Damon System in Spain. He first began using the Damon System in 2001 and since his visit to Dr. Damon’s surgery in Spokane, in 2003, he has exclusively used this system at his surgeries in Lleida and Tarragona."},{"picture_filename":"5a6f3c54b26ab_Perrini.jpg","firstname":"Federico","lastname":"Perrini","title":"Dottor","description":"Laureato In Odontoiatria e Protesi Dentaria nel 1994 presso l’ Università Di Siena. Frequenta il reparto di Anatomia presso il Kings College  di Londra diretto dal Prof. Berkovitz per le problematiche articolari nel 1994. Ottiene il Certificate of Orthodontics  presso Eastman Dental Center di Rochester (NY, USA) nel 1997. Collabora con il reparto di Gnatologia diretto dal Prof. Tallents presso Eastman Dental Center dal 1993. Specializzato presso la Scuola di Ortognatodonzia Università di Ferrara nel 2015.\r\n\r\nDocente presso la Scuola di Specializzazione di Ortognatodonzia Università di Ferrara.\r\n\r\nSocio SIDO, ASIO e AIDOR, International member AAO, socio American Lingual Orthodontics Association, socio Società Italiana Ortodonzia Linguale.\r\n\r\nRelatore presso Fondazione Castagnola,  SIDO,  ANDI,  AIO.\r\n\r\nRelatore presso il dipartimento di Ortodonzia Tufts University a Boston (MA, USA)."},{"picture_filename":"5e16fc2c417db_dr-diego-peydro-157x157.png","firstname":"Diego","lastname":"Peydró","title":"Dr.","description":"Doctor español- Especialista en la técnica Spark"},{"picture_filename":"5c389054da39e_pourrat.jpg","firstname":"Frank","lastname":"POURRAT","title":"Docteur","description":"Diplômé de la faculté de chirurgie dentaire de Bordeaux en 1977\r\nSpécialiste qualifié en orthopédie dento-faciale\r\nInstructeur aux formations de C GUGINO en technique bioprogressive\r\nInstructeur aux formations des Drs AUDION & DARMON en technique Edgewise\r\nFormation à la Tweed Foundation à Tucson (Arizona)\r\nMastère en Management par la Qualité en Santé\r\nDU d’orthodontie linguale, DU en occlusodontie, DU d’expertise bucco-dentaire\r\nTitulaire de la SFODF\r\nTitulaire de la société Bioprogressive\r\nFull Member de l’EACD (European Academy Cranio Mandibular Disorders)\r\nChargé de cours au DIU de laser et médecine dentaire de Bordeaux-Nice\r\nAuteur du livre « laser et orthodontie clinique »\r\nMaster Damon promotion 2 des Drs Perera & Espejo\r\nPlus de 15 conférences sur le thème du laser dans diverses sociétés savantes et Forum\r\nEt nombreuses autres conférences et articles dans différents domaines comme l’orthodontie clinique, l’hygiène, l’asepsie, le management et l’eco green.","link":"http:\/\/www.orthodontie-bordeaux.com\/"},{"picture_filename":"5947a5172cf43_Dr-C-S-Ramachandra.jpg","firstname":"C S","lastname":"Ramachandra","title":"Dr.","description":"Dr. C S Ramachandra completed his MDS – Orthodontics in year 1988 from Govt. Dental College, Bengaluru. He is now in teaching profession for more than 25 years. As a clinician, he has treated large number of patients with varying types of malocclusion and dentofacial deformities.\r\nArea of Interest: Orthodontic management of cleft lip and palate cases, surgical orthodontics and Self Ligating System.\r\nResearch and Training: He was the all India consultant for Vistadent-OC, a treatment simulation software used in orthodontic & orthognathic cases. He has conducted several training programs to create awareness among clinicians and postgraduate students about this software. Presently started conducting training programs to popularize SLB’s.\r\nHe is also a Diplomate of IBO which is a certification given by the IBO after being peer reviewed by the panel of judges about the quality of treatment rendered. He has developed interest in Damon Philosophy and started using the system in selected cases for last four years."},{"picture_filename":"5dd316d305106_Photo Katharina Renter 19 - Kopie.jpg","firstname":"Katharina","lastname":"Renter","title":"Frau","description":"– Katharina Renter zählte in den 90er Jahren zu den internationalen Topmodels. 10 Jahre lang lebte und arbeitete sie in den USA, u.a. in Miami, New York und Los Angeles.\r\n– Seit 1995 wechselte sie hinter die Kamera, und arbeitet seitdem als freie internationale Fotografin. Ihre Fotografien erschienen in Magazinen, wie z. B. Cosmopolitan, Cover for Business Vogue, Joy, etc.\r\n– 2011 – 2013 Chefredakteurin des Club 100 Magazins\r\n– 2012 – 2016 Expertin in über hundert Sendungen, live on Air, bei HSE 24\r\n– Seit 2014 Firmengründung – der KR MODEL AKADEMIE – Agentur für Model Ausbildung & Personality Coaching\r\n– Seit 2016 Firmengründung – des KR Loft Studios, in Taufkirchen bei München\r\n– Seit 2017 Motivational Speaker für Styling – die Psychologie der Kleidung, Selbstbewusstsein – Gang & Körpersprache.\r\n– Seit 2017 Project – The Power of Women Connection – Networking & Coaching für Frauen\r\n– Seit 2018 Wiedereinstieg als Best Ager Fotomodel, unter anderem für Kampagnen wie z. B. BMW, Moments Magazin"},{"picture_filename":"58da707791221_Jamie-Reynolds.jpg","firstname":"Jamie","lastname":"REYNOLDS","title":"Doctor","description":"•Member of the American Dental Association, the American Association of Orthodontists and Diplomate of the American Board of Orthodontics\r\n•Nationally recognized lecturer\r\n•Dr. Reynolds is recognized year after year by Hour Magazine as one of the top orthodontists in Metro Detroit. He lectures nationally and internationally on digitally customized orthodontics, the Damon System, advanced orthodontic technologies, soft-tissue lasers and aligners."},{"picture_filename":"5a12eae0ca7d8_riccardo rizzo.jpg","firstname":"Riccardo","lastname":"RIZZO","title":"Dottor","description":"Laurea in Medicina e Chirurgia e Specializzazione in Odontostomatologia e Protesi dentaria presso l’Università degli Studi di Torino con due tesi di argomento ortodontico.\r\n\r\nNella stessa Università, presso La Clinica Odontostomatologica, a partire dal 1979 sino al 2000, segue il percorso da studente ad Aiuto Ospedaliero, dapprima nel reparto di Ortodonzia e Pedodonzia ed in seguito alla Ortododonzia della Chirurgia Maxillo-Facciale. Ha ricoperti vari incarichi di insegnameto ed è autore di circa 40 pubblicazioni.\r\n\r\nFormatosi seguendo i corsi dei Prof. Giorgio Maj, Sergio Bassani, Michel Langlade, Carl Gugino, Norman Cetlin, Giorgio Fiorelli e con la partecipazione al Master Damon dei dottori Ramon Perera ed Rafael Garcia Espejo.\r\n\r\nSocio e frequentatore dei convegni di varie società ortodontiche quali SIDO, SIBOS, EOS,ESLO, AIOL.\r\n\r\nRelatore in convegni a carattere locale e nazionale su argometo ortodontico.\r\n\r\nSvolge attività privata in Provincia di Torino."},{"picture_filename":"5da4807385d85_montse.jpg","firstname":"Montse","lastname":"Rojas","title":"Dra.","description":"Se licencia en Odontología en la Universidad de Granada en el año 1991. Tras su licenciatura decide formarse en América donde realiza el Máster de Salud Pública y un Postgraduate Medical Education in GPR, (General Practice Residence) in the School of Dentistry, University of Puerto Rico, en 1993.\r\nEs a partir del año 2002 cuando decide especializarse en el área de la Ortodoncia. Realiza el Postgrado en Ortodoncia Progresive Orthodontic Seminars entre los años 2000 y 2002.\r\nMaster Damon en 2008 y 2009, Certificada en Invisalign, Rehabilitación Neuroclusal y certificada en Kinesiología Médica Odontológica.\r\nEs ponente habitual en eventos, y ha participado en Congresos a nivel nacional e internacional con el Sistema Damon.\r\nActualmente es Fundadora y Directora de AOS Damon e imparte el Programa Superior de formación en Damon. Es ponente oficial en las formaciones Damon"},{"picture_filename":"5a12eb0b6db94_G. Rossini.png","firstname":"Gabriele","lastname":"ROSSINI","title":"Dottor","description":"Laureato a pieni voti in Odontoiatria e Protesi dentaria nel Luglio 2012 presso l’Universitá degli Studi di Milano. Specializzato con lode e dignitá di stampa in Ortognatodonzia presso l’Universitá degli Studi di Torino. Iscritto al 1º anno del corso di Dottorato di Bioingegneria e Scienze Medico-Chirurgiche presso il Politecnico di Torino\/Universitá degli Studi di Torino.\r\n\r\nClinical advisor presso TNB S.r.l.\r\n\r\nAutore di numerosi articoi su riviste nazionali ed internazionali. Co-autore del capitolo 23 “Concetti di Gnatologia Neuromuscolare” del libro “Ortognatodonzia” – Autore Prof. Giampietro Farronato.\r\n\r\nSvolge attivitá di relatore presso corsi e congressi nazionali ed internazionali."},{"picture_filename":"5a12ea13d2f97_Sabatini.jpg","firstname":"Giuseppe","lastname":"SABATINI","title":"Dottor","description":"2002 Laurea in Odontoiatria e Protesi Dentaria.\r\nDal 2001 si occupa di Ortodonzia iniziando a frequentare il Reparto di Odontoiatria dell’Ospedale San Raffaele di Milano dove diventa nel 2004 responsabile di riunito.\r\n2003\/2004 Direttore responsabile del servizio di Odontoiatria del Centro Militare di Medicina Legale (C.M.M.L.)di Bologna.\r\n2008 Consulente scientifico presso il Reparto di Ortodonzia del Dipartimento di Odontoiatria “Ateneo Vita e Salute” Ospedale San Raffaele di Milano (Direttore Prof. Enrico Gherlone).\r\n2010 Master in tecnica Damon presso l’Università degli Studi di Ferrara.\r\n2012\/2013 Master Europeo sul Damon System rilasciato dall’Institut d’Ortodoncia Perera.\r\nDal 2004 utilizza tecniche a bassa frizione in particolare la tecnica Damon.\r\nDal 2008 Docente\/Moderatore del Damon System Study Club a Bergamo.\r\nDal 2013 Docente insieme al Dott.Davide Damiola nel corso “Realtà Clinica dei sistemi self-ligating passivi in ortodonzia”.\r\nSvolge la libera professione come consulente di Ortodonzia a Milano e Bergamo."},{"picture_filename":"5d619a21a7240_Dr_Reza_Saeidi_Pour.jpg","firstname":"Reza","lastname":"Saeidi Pour","title":"Dr.","description":"– Studium der Zahnmedizin an der Ludwig-Maximilians-Universität München\r\n– wissenschaftlicher Mitarbeiter an der Universität München, zuständig für Lehre und Ausbildung von Zahnmedizin-Studenten\r\n– Masterstudiengang Zahnmedizinische Prothetik an der Universität Greifswald\r\n– Spezialisierung auf dem Gebiet der ästhetisch-rekonstruktiven Zahnmedizin, der Funktionsdiagnostik und Funktionstherapie, sowie minimalinvasiver und innovativer Behandlungskonzepte in der zahnärztlichen Prothetik und Implantologie\r\n– Mitbegründer der dentalen Internetplattform www.rezottoproduction.com\r\n– Autor zahlreicher nationaler und internationaler wissenschaftlicher Publikationen"},{"picture_filename":"5c6d6e7b38a0f_BENEFIT-MEETING_DUSSELDORF2018-083.jpg","firstname":"Abbas","lastname":"SALAH","title":"Doctor","description":"Salah is an orthodontist. He has graduated from the dental school in Copenhagen, post graduate program for Orthodontics. Salah is working as an orthodontist both in the public and in the private sector. Salah’s special interests are treatments with mini-screws, biomechanical principles and interdisciplinary treatments as multiple agenesis patients and orthognathic cases."},{"picture_filename":"5a12ea688aab1_Salvato.jpg","firstname":"Giuseppe","lastname":"SALVATO","title":"Dottor","description":"Il Dott. Giuseppe Salvato è nato a Milano il 22\/4\/1971\r\n\r\nSpecializzazione in Chirurgia Maxillo-Facciale presso l’Università degli Studi di Milano direttore Prof. R. Brusati con votazione 70\/70 e lode. Dal 2000 al Dicembre 2010 ha ricoperto l’incarico di Dirigente medico di I livello presso l’Unità Operativa di Chirurgia Maxillo-Facciale dell’Ospedale San Gerardo di Monza.\r\n\r\nProfessore a contratto presso la Suola di Specializzazione in Chirurgia Maxillo-Facciale dell’Università degli Studi Milano-Bicocca. Dal 2010 al 2014 ricopre un incarico libero-professionale presso L’U.O. di Chirurgia Maxillo-Facciale dell’istituto Ortopedico Galeazzi Milano\r\n\r\nDal Novembre 2014 ricopre un incarico libero-professionale presso L’U.O. di Chirurgia Maxillo-Facciale dell’istituto Stomatologico di Milano. Dal 2017-2018 Prof. A .c. chirurgia maxillo-facciale per scuola specialita chirurgia orale Universita VITA E SALUTE Osp San Raffaele Milano Dir. Prof. E. GHERLONE\r\n\r\nE’ autore e coautore di diversi lavori scientifici su riviste nazionali ed internazionali; l’attività clinica e di ricerca si concentra principalmente nel campo della traumatologia maxillofacciale, ricostruzione delle ossa mascellari ed in particolare in chirurgia pre-protesica e implantologia, guide surgery; chirurgia ortognatodontica; chirurgia orale; chirurgia plastico-ricostruttiva ed estetica.\r\n\r\nIdeatore della tecnica GSOS\/GSCG in ortodonzia e chirurgia ortognatodontica per corticotomie e ostetomie dento alveolari. Libero professionista in Milano e Monza-brianza."},{"picture_filename":"5943ac84ab533_francisco_jose_sanchez-155x155.png","firstname":"Francisco José","lastname":"SANCHEZ","title":"Doctor","description":"•LICENCIADO EN MEDICINA Y CIRUGÍA por la Universidad de Santiago de Compostela en 1985\r\n•GRADUADO EN MEDICINA Y CIRUGÍA por la Universidad de Santiago de Compostela en 1986\r\n•CURSOS MONOGRÁFICOS DEL DOCTORADO, realizados en la Universidad de Santiago de Compostela en 1986-1987\r\n•ESPECIALISTA EN ESTOMATOLOGÍA por la Universidad de Santiago de Compostela en 1988\r\n•MÁSTER EN ODONTOPEDIATRÍA, realizado en el Hospital San Rafael de Madrid en 1989\r\n•Máster en ORTODONCIA, DIRIGidO POR el Dr.Jean Fleur, curso CEAR, en Sitges en 1993-1994\r\n•Máster en SISTEMA DAMON de ortodoncia en Madrid, en los años 2008-2009"},{"picture_filename":"59df5182666fa_Grzegorz_Sanocki.png","firstname":"Grzegorz","lastname":"Sanocki","title":"Dr.","description":"Dr Grzegorz Sanocki ukończył studia ortodontyczne na Uniwersytecie Warwick uzyskując tytuł Master of Science in Orthodontics (MSc in Orthodontics).\r\n\r\nOrtodoncją zajmuje się od 2001 roku w tym Systemem Damona od 2005.\r\n\r\nObecnie prowadzi praktykę ortodontyczną w Londynie oraz Gorzowie Wielkopolskim jak również jest asystentem nauczania klinicznego na Uniwersytecie Warwick.\r\n\r\nProwadzi zajęcia Damon Study Club i jest zaangażowany w rozwój systemu Damona w Polsce."},{"picture_filename":"58da5efcbb6c3_david server.jpg","firstname":"David","lastname":"SARVER","title":"Doctor","description":"•Diplomate of the American Board of Orthodontics and a member of the Angle Society of Orthodontics.\r\n•Adjunct professor at the University of North Carolina.\r\n•Authored the orthodontic text, “Esthetic Orthodontics and Orthognathic Surgery” and co- authored “Contemporary Treatment of Dentofacial Deformity”. Additionally, co-authored the chapter on orthodontic diagnosis and treatment-planning in “Orthodontic Practice and Principles”, the most widely-used graduate orthodontic textbook in the world.\r\n•Internationally recognized lecturer."},{"picture_filename":"5a894ffc875ae_Marija Rakic.png","firstname":"Marija","lastname":"Saupe","title":"Dr.","description":"Ÿ Graduated in 1994 on Belgrade Dental University\r\nŸ Since 2009 is licensed International Damon lecturer.\r\nŸ Since 2012 – KOL for ORMCO.\r\nŸ Lecturing several times in Hungary, Romania, Czech,\r\nGeorgia, Albania, Serbia, Bosnia, Montenegro,\r\nMacedonia, Senegal, South Africa …\r\nŸ Courses are best for Damon system beginners."},{"picture_filename":"5dd3164232de1_Bild1.jpg","firstname":"Petra","lastname":"Schmidt","title":"Frau","description":"– Zahnmedizinische Fachassistentin mit Wirken in verschiedenen Praxen, Universität Tübingen und Ulm\r\n– Weiterbildungen im Bereich Zahnmedizin, Kommunikation und Qualitätsmanagement\r\n– Ersthelferin, Praxismanagerin, Referentin, QM-Auditorin\/TÜV\r\n– Trainerin für ZMV, ZMP, DH\r\n– Co-Autorin für Kieferorthopädie im Zahnarztverlag\r\n– Veröffentlichungen in Fachzeitschriften\r\n– Referententätigkeit in den Bereichen kieferorthopädische Abrechnung BEMA und GOZ, Praxismanagement, Qualitätsmanagement in der Praxis, Kommunikation, Rhetorik, Körpersprache, Ausbildung, Pädagogik und Weiterbildung"},{"picture_filename":"5c7555ccb8fc3_Dr_Sebastian_Schulz.jpg","firstname":"Sebastian","lastname":"Schulz","title":"Dr.","description":"–","link":"www.ieq-health.de"},{"picture_filename":"57bafedfbaa9d_timthumb-1.php.jpeg","firstname":"Giuseppe","lastname":"SCUZZO","title":"Doctor","description":"Le Dr Giuseppe Scuzzo est diplômé de la Faculté de Médecine de Rome (1983), spécialiste en odontologie\r\n(1987) et en orthodontie (Université de Ferrare).\r\nDepuis 1983, il s’intéresse plus particulièrement à l’orthodontie linguale. Auteur de nombreuses publications\r\ninternationales sur cette technique (70), le Dr Scuzzo a également donné des conférences\r\nen Italie et dans le monde entier.\r\nIl travaille en collaboration avec les principales universités européennes et enseigne la technique\r\nlinguale à l’université de Ferrare, tout en étant Professeur associé à l’université Complutense de Madrid.\r\nIl dirige également les Masters d’Orthodontie Linguale de ces 2 universités. Il a réalisé de nombreuses\r\ncommunications à travers le monde et a publié avec le Dr Takemoto, 3 ouvrages sur la technique linguale. Le\r\ncabinet du Dr Scuzzo à Rome est exclusivement consacré à la pratique de l’orthodontie linguale.\r\nCertifié EBO (European Board Orthodontists), seule certification européenne sur tous les cas linguaux\r\nCertifié WBLO (World Board of Lingual Orthodontists)."},{"picture_filename":"5f1ae6cd0dbd9_giacomo-scuzzo-v2-min-square.png","firstname":"Giacomo","lastname":"Scuzzo","title":"Dr.","description":"Dr. Giacomo Scuzzo, laureato in Odontoiatria nel 2012 presso l'Universitá Europea di Madrid,\r\nspecializzato in Ortodonzia nel 2016 presso l'Universitá di Ferrara.\r\nHa sempre lavorato esclusivamente in ortodonzia, con un interesse particolare per l'ortodonzia\r\nlinguale.\r\nÉ professore a contratto di ortodonzia digitale presso l'Universitá di Ferrara e istruttore clinico\r\ndi tecnica di ortodonzia linguale presso l'Universitá Complutense di Madrid.\r\nIl Dr. Scuzzo ha parlato e pubblicato in Italia e all'estero sull'ortodonzia linguale.\r\nMembro del consiglio direttivo della Societá Italiana di Ortodonzia Linguale (AIOL).\r\nIl Dr. Scuzzo ha uno studio privato limitato all'ortodonzia linguale a Roma, in Italia."},{"picture_filename":"5d6199558f772_Dr_Peter_Seehofer.jpg","firstname":"Peter","lastname":"Seehofer","title":"Dr.","description":"Dr. Peter Seehofer hat 1987 die 1958 gegründete Praxis übernommen. Mit annähernd 300 Fortbildungen, Zusatzausbildungen und Curricula hat sich Dr. Seehofer eine umfangreiche Expertise in allen Bereichen der Zahnmedizin erworben. 2014 wurde die Praxis umfassend durch kompetente und hoch spezialisierte Fachärzte erweitert. So können auch sehr komplexe Fälle mit der Fachkompetenz aller vier Experten umfassend behandelt werden."},{"picture_filename":"5c744ccd0b73e_Dr_Hans_Seeholzer.jpg","firstname":"Hans","lastname":"Seeholzer","title":"Doctor","description":"Dr. Hans Seeholzer received his dental degree at the University of Munich, practical training in many well known Universities and offices in US. Owner of a big size office for 38 years near Munich. Finished more than 10 000 Patients. Since 27 years well known trainer and consultant for management, marketing and communication in Europe, Russia and Asia. Aerobatic pilot specialized in Russian planes, air photographer and publisher. Enjoy life!","link":"www.seeholzer.de"},{"picture_filename":"58ece0dfc60fa_06_MARTIN_SIMMEL-157x157.png","firstname":"Martin","lastname":"SIMMEL","title":"Dipl.- Psich","description":"Jahrgang 1973, Studium der Betriebswirtschaftslehre und Psychologie in Regensburg.\r\n\r\nViele Jahre tätig als Psychotherapeut und Abteilungsleiter an der Ersten Deutschen Klinik für Traditionelle Chinesische Medizin in Bad Kötzting.\r\n\r\nJetzt Geschäftsführer der Professor Wühr und Simmel Gesundheits MANAGEMENT Systeme GbR und Mitinhaber der Praxisgemeinschaft Systemische Medizin PraSyMed in Regensburg, sowie Mitbegründer der Initiative Gesunde Unternehmen.\r\n\r\n„Es sind die Menschen, deren Fähigkeiten und Wertvorstellungen, die das grundlegende Kapital eines jeden Unternehmens darstellen. Deshalb ist es notwendig und sinnvoll, diesen besondere Aufmerksamkeit zu schenken!“ Diesem Leitgedanken entsprechend und auf der Basis seiner Erfahrungen als Trainer und Coach in der Team- und Führungskräfteentwicklung für international ausgerichtete Konzerne, verwirklicht er mit seinen Partnern und Kunden maßgeschneiderte und ergebnisorientierte Seminare, Trainings und Beratungskonzepte.\r\n\r\nAls Redner und Key-Note-Speaker begeistert er sein Publikum zu den Themen „Hauptsache GESUNDHEIT!“, „Charisma“ und „How not to get shot“ auf Vorträgen, Symposien und Kongressen im In- und Ausland.\r\n\r\nAls Autor und Referent widmet er sich neben Themen des erfahrungs- und handlungsorientierten Lernens, werteorientierten Führungssystemen auch der Bewältigung von Burnout Phänomenen. Als Lehrbeauftragter unterrichtet er an der Hochschule Studenten in den Themen der Emotionalen Intelligenz, Prävention und Gesundheitsbildung.\r\n\r\nseit 1999   freiberuflicher Berater und Trainer für Führungskräfte und Unternehmen\r\n\r\n2000 Diplom-Psychologe, Abschluss des Studiums an der Universität Regensburg\r\n\r\n2000 – 2007 Stellvertretender Leiter an der Erziehungs-, Jugend-  und Familienberatungsstelle Cham,\r\nQualitätsmanagementbeauftragter\r\n2007 – 2012 bteilungsleiter an der Ersten Deutschen Klinik für Traditionelle Chinesische\r\n Medizin in Bad Kötzting, Aufbau einer Psychotherapeutischen Abteilung und\r\n Einführung des sino european prevention program\r\nseit 2013 Gesellschafter und Geschäftsführer der Professor Wühr  und Simmel\r\n Gesundheits MANAGEMENT Systeme GbR\r\n sowie Mitbegründer der Praxisgemeinschaft Systemische Medizin\r\n PraSyMed in Regensburg\r\n2014 Mitbegründer der Initiative Gesunde Unternehmen"},{"picture_filename":"58ee943aa80de_Dr_Smith_Bob.png","firstname":"Bob","lastname":"SMITH","title":"Doctor","description":"Diplômé de l’université Emory en médecine\r\ndentaire depuis 1975, le Dr John R.(Bob) Smith\r\na obtenu un Master en orthodontie\r\nà l’université de Washington en 1977.\r\nUn an plus tard, il remporte le prix Milo Hellman décerné\r\npar l’American Association of Orthodontists.\r\nBob doit son succés aux recherches sur les appareils\r\nlinguaux effectuées dans le cadre de la « Lingual\r\nTask Force » d’Ormco, dont il a été membre\r\nfondateur.\r\nIl a tenu des conférences dans le monde entier sur\r\nde nombreux sujets orthodontiques. Il a également\r\npublié plusieurs d’articles dans les domaines suivants\r\n: orthodontie linguale, appareils Herbst de\r\nmini-vis et protocoles de traitement permettant\r\nl’amélioration de l’efficacité clinique grâce à des\r\ntorques variables.\r\nDepuis 2005, il participe au développement des\r\nappareils Insigna avec plus de 1500 cas traités par\r\nbrackets conventionnels ou autoligaturants passifs.\r\nIl présentera dans quelle mesure ce système couplé\r\nau scanner Lythos a amélioré l’efficacité de ses\r\ntraitements orthodontiques."},{"picture_filename":"5c66aec75f3a0_Headshot A Smith.PNG","firstname":"Ashley","lastname":"SMITH","title":"Dr.","description":"Dr. Ashley Smith completed his Dental degree and graduated from the University of Queensland (UQ) in 1980.  He then completed his masters in Orthodontics (UQ) in 1986.  He has been in private orthodontic practice for over 30 years and is actively involved in improving and teaching the best practice for the Insignia appliance.  Dr. Smith has extensive experience in treatment and teaching the management of complex cases, with and without surgery."},{"picture_filename":"5d619b2f32dfc_Dr_Boris_Sonnenberg_kleiner.jpg","firstname":"Boris","lastname":"Sonnenberg","title":"Dr.","description":"– 1991–1999: Studium der Zahnmedizin und Promotion an der Eberhard-Karls-Universität Tübingen\r\n– 2001: Fachzahnarzt für Kieferorthopädie\r\n– 2002: Gründung der kieferorthopädischen Gemeinschaftspraxis Sonnenberg\r\n– seit 2004: Clinical Speaker Invisalign und Member of the Invisalign European Clinical Education Council 2004\r\n– seit 2006: Ernennung zum Prof. invitado an der staatl. Universität Sevilla\r\n– seit 2008: Gründungsmitglied und Vizepräsident der Deutschen Gesellschaft für Aligner Orthodoxie (DGAO e.V.)\r\n– seit 2009: KZV-Gutachter der KZV BW\r\n– seit 2010: Weiterbildungsermächtigung \r\n– 2014: Eröffnung der digitalisierten Lean Management Praxis Stuttgart\r\n– 2018: Gründer und Aufsichtsrat der Medondo AG"},{"picture_filename":"57ee66843ff73_silke spanlang.jpg","firstname":"Silke","lastname":"SPANLANG","title":"Doctor","description":"Schwerpunkte: Erwachsenentherapie,\r\nUmstellungsosteotomien,\r\nKFO-Vorbereitung für\r\nFull Mouth Restaurationen in\r\nzentrischer Relation\r\nlaufendes PhD-Studium und laufendes\r\nMedizinstudium an der Medizinischen Universität Wien\r\nOktober 2015 Eröffnung einer Zweitordination im 19. Bezirk in Wien, Döblinger Hauptstraße 66\r\nJänner 2015 Eröffnung einer kieferorthopädischen Privatordination in Wien im 1. Bezirk am\r\nStephansplatz\r\n2014 – 2015 „2 years international advanced orthodontic course“ in San Sebastian (Spanien)\r\nund Parma (Italien), Prof. Dr. Domingo Martin und Prof. Dr. Renato Cocconi\r\nseit 2011 diverse Vorträge in Qualitätszirkeln und Kursbeiträge in Österreich und Deutschland\r\n2011 – 2015 Konsiliarärztin für Kieferorthopädie in diversen Ordinationen in Wien und Linz\r\n2012 – 2014 Postgraduales Universitätsstudium in Bonn zur Erlangung des „Master of Science\r\nfür Kieferorthopädie“\r\n2010 – 2011 Kieferorthopädin an der Klinik für Mund-Kiefer- und Gesichtschirurgie,\r\nKepler Universitätsklinikum, Linz\r\nJuni 2010 Semmelweis Universität, Promotion zu Dr. med. dent.\r\n2002 – 2007 Studium der Zahnmedizin, Medizinische Universität Wien"},{"picture_filename":"5bd1c48b2d8bf_luigi taiariol.jpg","firstname":"Luigi","lastname":"TAIARIOL","title":"Chirurgien maxillo-facial","description":"Membre de la société francaise de chirurgie maxillo-faciale et stomatologie\r\nMembre du groupe GENIOS de recherche en ostéosynthèse de la face\r\nLe docteur Luigi Taiariol est chirugien maxillo-facial depuis 1998.\r\n Ancien interne des hopitaux de nantes, ancien Chef de clinique des hopitaux de Nantes, il exerce en activité libérale depuis 2004 tout en gardant une activité partielle hospitalière en tant que praticien attaché des hopitaux au C.H. U. de Nantes.\r\n Il effectue également régulièrement des missions humanitaires dans le cadre de prise en charge des fentes labio-palatines.","link":"http:\/\/www.consultationdusourire.fr\/luigi-taiariol\/"},{"picture_filename":"58da23580e0d0_takemoto.png","firstname":"Kyoto","lastname":"TAKEMOTO","title":"Doctor","description":"Dr. Kyoto Takemoto graduated in 1979 from the Tokyo Dental College, with his specialty in\r\nOrthodontics in 1981 from Tokyo Medical-Dental University. As an EBO and WBLO diplomate,\r\nDr. Takemoto is a world leader in lingual orthodontics, an active principle in multiple global lingual\r\northodontic societies and was the former president and the founding director of the World Board of\r\nLingual Orthodontics and World Society of Lingual Orthodontics. He holds numerous global patents\r\nin lingual orthodontics and has pioneered the advancement of the Lingual Straight Wire method. In\r\naddition to his renowned research and teaching, Dr. Takemoto has a private practice in Japan, where\r\nhe practices lingual orthodontics exclusively."},{"picture_filename":"5a33a27068d04_dr.tamanza-157x157.png","firstname":"Fabio","lastname":"TAMANZA","title":"Dottor","description":"Laureato in Medicina e Chirurgia presso l’ Università degli studi di Milano nel 1978, specialista in Chirurgia Maxillo-Facciale presso la stessa Università nel 1985, Capo Reparto di Ortodonzia presso l’istituto Stomatologico Italiano di Milano dal 1985, Master in Tecnica Ortodontica Damon nel 2010, professore a contratto presso l’Università di Genova a.a. 2011-2012, Trainer di Programmazione Neuro Linguistica dal 1991, Councellor PNL dal 2003, Fellow Member Trainer della International Association for NLP (IANLP) dal 2004, Coach  PNL secondo i programmi della IANLP dal 2012, esperto in Ipnosi Ericksoniana, relatore a congressi, autore di publicazioni."},{"picture_filename":"58527133bff85_andrey Tikhonov.png","firstname":"Andrey","lastname":"TIKHONOV","title":"Doctor","description":"Doctor-orthodontist and a consultant of Ormco product usage. Began\r\nwork with the Damon system in 2004. Participation in many international\r\northodontics congresses (Damon Symposium, Damon Forum). Carried\r\nout hundreds of orthodontics seminars in more than 30 cities and in\r\nseven states. Certified lecturer in Europe on the topic “Damon System”."},{"picture_filename":"5a71f2ad6c5f0_MICHAEL 2.JPG","firstname":"Michael","lastname":"TULCHINSKY","title":"Doctor","description":"Graduated dental School on 1990 and orthodontic\r\nErasmus approved program on 1996 at Tel Aviv University\r\nSpecialist in Orthodontics (Israeli bord exams)\r\nClinical instructor, Orthodontic Department,\r\nIsrael Defense Forces, Tel Aviv\r\nPrivate Clinic in Tel Aviv dedicated to advanced\r\northodontic modalities and treatments\r\nOrmco Insignia speaker in Europe since 2015"},{"picture_filename":"5ab2c4c562673_Dr_Becelaere_Jean-Rene_Van-1x1.3.jpg","firstname":"Jean-René","lastname":"VAN BECELAERE","title":"Doctor","description":"Dr. Van Becelaere began his studies in Lille, France and continued at the Université de Montréal where he graduated in 1971 in dentistry. He then specialized in orthodontics completing his studies in Montreal in 1976. His continuing education has included programs in Osteopathy and Posturology. With over 40 years in orthodontic practice, he is a member of the Progressive Study Club and an active lecturer at conferences in Europe, Asia and around North America."},{"picture_filename":"58076797b2d65_PVS201607.jpg","firstname":"Philippe","lastname":"VAN STEENBERGHE","title":"Doctor","description":"Spécialiste qualifié\r\nen orthodontie.\r\nEx chef d'unité\r\northodontie du C.H.U.\r\nSaint-Pierre à Bruxelles.\r\nExercice privé exclusif\r\nOrtho Team (clinique\r\northodontique privée)\r\nConférencier\r\net consultant."},{"picture_filename":"5e01dcd2831fc_lLon Verhagen.jpg","firstname":"Leon","lastname":"Verhagen","title":"Dr.","description":"› Dr. Leon Verhagen completed his general dental training at The Radboud University of Nijmegen (The Netherlands) in 1980.\r\n› He started a center of Integrated and Interdisciplinary Dental Care in Lichtenvoorde that same year.\r\n› In 1986 he completed his specialty in Implantology and in 1996 he completed his specialty in Orofacial pain and Temporomandibular disorders at the University of Utrecht.\r\n› He completed his gp-orthodontic training in 1992 and completed his master in laser dentistry at the University of Vienna in 2005.\r\n› Dr. Leon Verhagen has been in private Interdisciplinary Dental Care practice in Lichtenvoorde, The Netherlands since 1980 and runs satellite clinics in Groenlo and Aalten.\r\n› In 2004 he founded the course center Integrated Dentistry\/ Integrated Orthodontics and trains GP’s (2 year program) and Orthodontists together with their staff in integrating Insignia and Digital Orthodontics in their offices.\r\n› Dr. Leon Verhagen is a member of many (inter) national scientific societies and lectures (inter) nationally on topics including TMD and orofacial Pain, Implantology, Laser dentistry, Orthodontics and their integration.\r\n› He has a great interest in the possibilities of 3D digital technology."},{"picture_filename":"5a6a2e3866a8b_speaker_icon.png","firstname":"Programme","lastname":"Voir","title":"Docteurs et experts","description":"Se réferer au programme détaillé pour connaître la liste exahustive des conférenciers"},{"picture_filename":"59410d28379ec_Dr. Agata_Walkowiak_Sliziuk.jpg","firstname":"Agata","lastname":"Walkowiak-Śliziuk","title":"Dr.","description":"Dr Agata Walkowiak-Śliziuk studia medyczne ukończyła na wydziale stomatologii Pomorskiej Akademii Medycznej w 1994 r.\r\nTytuł specjalisty II-go stopnia ortodoncji uzyskała w 2002 roku. Wcześniej zdała Państwowy Egzamin I-go stopnia ze stomatologii ogólnej.\r\nSpecjalizację z ortodoncji zdobywała pod kierunkiem dr n. med. I. Doniec-Zawidzkiej w Zakładzie Ortodoncji Pomorskiej Akademii Medycznej.\r\nUczestniczyła w licznych kursach znanych wykładowców , kongresach towarzystw ortodontycznych. \r\nProwadzi wykłady i ćwiczenia dla logopedów w Akademii im. Jakuba z Paradyża w Gorzowie Wielkopolskim. Jest członkiem PTO i EOS. Od 15 lat prowadzi specjalistyczną praktykę lekarską w Gorzowie Wlkp. \r\nW ramach przyznanej akredytacji prowadzi szkolenie specjalizacyjne z ortodoncji lekarzy dentystów."},{"picture_filename":"5c751d4897411_Prof_Dr_Erich_Wuehr.jpg","firstname":"Erich","lastname":"Wühr","title":"Prof. Dr. med. dent.","description":"–","link":"www.gms-institut.de"}]
